["Red Lentil Soup with Chicken and Turnips might be a good recipe to expand your main course repertoire. This recipe serves 8 and costs $3.0 per serving. One serving contains 477 calories, 27g of protein, and 20g of fat. It is brought to you by Pink When. 1866 people have tried and liked this recipe. It can be enjoyed any time, but it is especially good for Autumn. From preparation to the plate, this recipe takes approximately 55 minutes. It is a good option if you're following a gluten free and dairy free diet. Head to the store and pick up salt and pepper, canned tomatoes, flat leaf parsley, and a few other things to make it today. Overall, this recipe earns a spectacular spoonacular score of 99%. If you like this recipe, you might also like recipes such as Red Lentil and Chicken Soup, Red Lentil and Chicken Soup, and Red-Lentil Soup.","Cheesy Chicken Enchilada Quinoa Casserole might be just the Mexican recipe you are searching for. One serving contains 594 calories, 34g of protein, and 24g of fat. This gluten free recipe serves 4 and costs $2.62 per serving. A mixture of corn, pepper, canned tomatoes, and a handful of other ingredients are all it takes to make this recipe so delicious. From preparation to the plate, this recipe takes approximately 30 minutes. It will be a hit at your Autumn event. Plenty of people made this recipe, and 9912 would say it hit the spot. It works well as an affordable main course. It is brought to you by Pink When. With a spoonacular score of 97%, this dish is amazing. If you like this recipe, you might also like recipes such as Cheesy Chicken Enchilada Quinoa Casserole, Cheesy Chicken Enchilada Quinoa Casserole, and Cheesy Chicken Enchilada Quinoa Casserole.","You can never have too many main course recipes, so give Stir Fried Quinoa, Brown Rice and Chicken Breast a try. This recipe serves 1 and costs $3.58 per serving. One serving contains 750 calories, 58g of protein, and 20g of fat. 39 people were impressed by this recipe. If you have cherry tomatoes, spring onion, butter, and a few other ingredients on hand, you can make it. It is brought to you by Afrolems. From preparation to the plate, this recipe takes roughly 45 minutes. It is a good option if you're following a gluten free diet. All things considered, we decided this recipe deserves a spoonacular score of 95%. This score is tremendous. Try Stir-fried chicken with broccoli & brown rice, Stir-Fried Broccoli with Brown Rice {Meat Optional}, and Stir-fried Chickpeas And Asparagus With Brown Rice And Lemon Ta for similar recipes.","Need a gluten free and primal main course? Spinach Salad with Strawberry Vinaigrette could be a great recipe to try. This recipe makes 1 servings with 322 calories, 22g of protein, and 13g of fat each. For $3.39 per serving, this recipe covers 33% of your daily requirements of vitamins and minerals. A mixture of water, balsamic vinegar, ground pepper, and a handful of other ingredients are all it takes to make this recipe so delicious. It will be a hit at your Mother's Day event. 15 people have made this recipe and would make it again. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 96%. This score is awesome. If you like this recipe, take a look at these similar recipes: Strawberry Avocado Spinach Salad with Strawberry Vinaigrette, Strawberry Avocado Spinach Salad with Strawberry Vinaigrette, and Spinach Strawberry Salad with Strawberry Vinaigrette.","Herb chicken with sweet potato mash and sautéed broccoli might be a good recipe to expand your main course recipe box. One portion of this dish contains roughly 47g of protein, 25g of fat, and a total of 710 calories. For $3.13 per serving, this recipe covers 50% of your daily requirements of vitamins and minerals. This recipe serves 4. 9 people have made this recipe and would make it again. Head to the store and pick up broccoli, butter, pepper and salt, and a few other things to make it today. It is a good option if you're following a gluten free diet. It is brought to you by Foodista. From preparation to the plate, this recipe takes around 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 95%, which is awesome. Try Herb chicken with sweet potato mash and sautéed broccoli, Herb chicken with sweet potato mash and sautéed broccoli, and Herb chicken with sweet potato mash and sautéed broccoli for similar recipes.","Chicken and Mango Skewer takes roughly 45 minutes from beginning to end. This recipe serves 1 and costs $4.51 per serving. One portion of this dish contains about 31g of protein, 8g of fat, and a total of 479 calories. It is brought to you by Afrolems. A few people made this recipe, and 19 would say it hit the spot. A mixture of pepper, suya seasoning mix, mangos, and a handful of other ingredients are all it takes to make this recipe so scrumptious. It works well as a pretty expensive main course. It is a good option if you're following a gluten free, dairy free, and whole 30 diet. Overall, this recipe earns a spectacular spoonacular score of 95%. Users who liked this recipe also liked Grilled Chicken Caesar on a Skewer, Thai Chicken Skewer Appetizers with Sweet and Spicy Chili Sauce, and S’more Skewer Bites.","You can never have too many main course recipes, so give Turkish Chicken Salad with Home-made Cacik Yogurt Sauce a try. This recipe serves 4 and costs $4.48 per serving. Watching your figure? This gluten free recipe has 643 calories, 67g of protein, and 30g of fat per serving. 9 people found this recipe to be tasty and satisfying. Head to the store and pick up lebanese cucumber, roast chicken, garlic, and a few other things to make it today. From preparation to the plate, this recipe takes around 45 minutes. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 95%. This score is outstanding. Similar recipes include Spicy Lamb Kabobs With Turkish Cacik, Jerk Rubbed Chicken Thighs with Home-Made Mango-Habanero Hot Sauce, and Yogurt and Cucumber Dip Cacik.","Gluten Free Dairy Free Sugar Free Chinese Chicken Salad is a gluten free and dairy free main course. This recipe serves 6 and costs $3.06 per serving. One serving contains 364 calories, 31g of protein, and 15g of fat. If you have scallions, pepper, kosher salt, and a few other ingredients on hand, you can make it. This recipe from Foodista has 3 fans. Not a lot of people really liked this Chinese dish. From preparation to the plate, this recipe takes about 45 minutes. With a spoonacular score of 94%, this dish is great. If you like this recipe, take a look at these similar recipes: Gluten Free Dairy Free Sugar Free Chinese Chicken Salad, Thousand Island Dressing (Gluten-Free, Corn-Free, Dairy-Free, Soy-Free, Nut-Free, Gum-Free and Refined Sugar-Free), and Skinny Double Chocolate Muffins-Vegan, Gluten Free, Dairy Free, Egg Free and Refined Sugar Free.","4 Ingredient Chicken Pot Pie might be a good recipe to expand your main course recipe box. This recipe serves 6 and costs $4.41 per serving. One serving contains 802 calories, 79g of protein, and 30g of fat. Head to the store and pick up pie crust, campbell's chicken gravy, cans swanson premium chicken breast in water, and a few other things to make it today. It is a good option if you're following a dairy free diet. 24 people have tried and liked this recipe. From preparation to the plate, this recipe takes approximately 45 minutes. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 90%. This score is excellent. Try Instant Pot 5-Ingredient Chicken Tacos, 5-Ingredient Crock Pot Mexican Shredded Chicken, and 4-Ingredient Mini Chicken Pot Pies | Simple Meals for similar recipes.","The recipe Chicken Suya can be made in roughly 45 minutes. This recipe serves 1 and costs $1.67 per serving. One serving contains 564 calories, 44g of protein, and 35g of fat. This recipe from Afrolems requires suya spice, chicken, chilli powder, and seasoning cubes. It works well as a main course. 56 people have made this recipe and would make it again. It is a good option if you're following a gluten free, dairy free, whole 30, and ketogenic diet. Overall, this recipe earns a solid spoonacular score of 79%. If you like this recipe, you might also like recipes such as Suya (Nigerian Chicken Skewers), Suya Swordfish, and I Ain't Chicken Chicken: Crispy Roasted Chicken Breasts with Orange and Cardamom.","Asparagus and Pea Soup: Real Convenience Food requires approximately 20 minutes from start to finish. Watching your figure? This gluten free, dairy free, paleolithic, and lacto ovo vegetarian recipe has 217 calories, 11g of protein, and 8g of fat per serving. This recipe serves 2. For $1.78 per serving, this recipe covers 25% of your daily requirements of vitamins and minerals. Autumn will be even more special with this recipe. It works well as a hor d'oeuvre. 207 people have tried and liked this recipe. It is brought to you by fullbellysisters.blogspot.com. A mixture of vegetable broth, evoo, garlic, and a handful of other ingredients are all it takes to make this recipe so yummy. All things considered, we decided this recipe deserves a spoonacular score of 96%. This score is outstanding. Try Asparagus and Pea Soup: Real Convenience Food, Asparagus and Pea Soup: Real Convenience Food, and Asparagus and Pea Soup: Real Convenience Food for similar recipes.","Tuscan White Bean Soup with Olive Oil and Rosemary is a gluten free, dairy free, lacto ovo vegetarian, and vegan recipe with 6 servings. This main course has 242 calories, 16g of protein, and 1g of fat per serving. For 50 cents per serving, this recipe covers 19% of your daily requirements of vitamins and minerals. It will be a hit at your Autumn event. 22 people found this recipe to be tasty and satisfying. Head to the store and pick up olive oil, rosemary, garlic, and a few other things to make it today. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly 45 minutes. With a spoonacular score of 79%, this dish is good. If you like this recipe, take a look at these similar recipes: White Bean Soup with Pastan and Rosemary Oil Drizzle, Tuscan White Bean and Fennel Stew With Orange and Rosemary, and Tuscan White Bean Soup.","Herbivoracious' White Bean and Kale Soup might be a good recipe to expand your main course recipe box. One serving contains 332 calories, 17g of protein, and 10g of fat. This recipe serves 6 and costs 78 cents per serving. 10 people were impressed by this recipe. It will be a hit at your Autumn event. Head to the store and pick up juice of lemon, carrot, dinosaur kale, and a few other things to make it today. It is brought to you by Foodista. From preparation to the plate, this recipe takes approximately 45 minutes. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. All things considered, we decided this recipe deserves a spoonacular score of 94%. This score is tremendous. Kale And White Bean Soup, White Bean And Kale Soup, and White Bean Kale Soup are very similar to this recipe.","Tomato and lentil soup might be a good recipe to expand your main course recipe box. This recipe makes 4 servings with 340 calories, 18g of protein, and 8g of fat each. For $1.16 per serving, this recipe covers 34% of your daily requirements of vitamins and minerals. It is perfect for Autumn. This recipe from Foodista requires bay leaf, onion, garlic, and carrots. 11 person were glad they tried this recipe. From preparation to the plate, this recipe takes about 45 minutes. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. With a spoonacular score of 96%, this dish is great. Users who liked this recipe also liked Tomato and Lentil Soup, Lentil-Tomato Soup, and Lentil & Tomato Soup.","The recipe Moroccan chickpean and lentil stew can be made in roughly 30 minutes. This dairy free, lacto ovo vegetarian, and vegan recipe serves 3 and costs $1.26 per serving. This main course has 466 calories, 20g of protein, and 7g of fat per serving. This recipe is liked by 11 foodies and cooks. It can be enjoyed any time, but it is especially good for Autumn. It is brought to you by Foodista. If you have olive oil, salt and pepper, tomato paste, and a few other ingredients on hand, you can make it. All things considered, we decided this recipe deserves a spoonacular score of 97%. This score is outstanding. If you like this recipe, you might also like recipes such as Moroccan chickpean and lentil stew, Butternut Squash, Chickpea & Lentil Moroccan Stew, and Butternut Squash, Chickpea & Lentil Moroccan Stew.","Caldo Verde - Portuguese Kale Soup takes approximately 45 minutes from beginning to end. One portion of this dish contains around 20g of protein, 10g of fat, and a total of 493 calories. For $2.24 per serving, this recipe covers 35% of your daily requirements of vitamins and minerals. This recipe serves 4. 13 people were glad they tried this recipe. It is a good option if you're following a gluten free, dairy free, and whole 30 diet. It is brought to you by Foodista. It works well as a main course. It will be a hit at your Autumn event. Head to the store and pick up onion, carrots, pepper flakes, and a few other things to make it today. With a spoonacular score of 92%, this dish is outstanding. Users who liked this recipe also liked Portuguese Kale Soup (Caldo Verde), Caldo Verde - Portuguese Kale Soup, and Caldo Verde | Portuguese Kale Soup.","If you want to add more gluten free, dairy free, lacto ovo vegetarian, and vegan recipes to your recipe box, Curried Butternut Squash and Apple Soup might be a recipe you should try. For $1.41 per serving, this recipe covers 16% of your daily requirements of vitamins and minerals. This recipe serves 1. One serving contains 134 calories, 7g of protein, and 3g of fat. A mixture of a squirt sriracha, butternut squash, apple, and a handful of other ingredients are all it takes to make this recipe so yummy. It is perfect for Autumn. It works well as a hor d'oeuvre. This recipe from Foodista has 9 fans. From preparation to the plate, this recipe takes around 45 minutes. Overall, this recipe earns an awesome spoonacular score of 89%. Similar recipes include Curried Apple + Butternut Squash Soup, Curried Butternut Squash and Apple Soup, and Curried Butternut Squash & Apple Soup - Crock Pot.","Chilled Cucumber Avocado Soup with Yogurt and Kefir is a gluten free, lacto ovo vegetarian, and primal hor d'oeuvre. This recipe serves 3 and costs $2.1 per serving. One portion of this dish contains approximately 9g of protein, 7g of fat, and a total of 189 calories. 171 person were impressed by this recipe. A mixture of avocado, kefir, onion, and a handful of other ingredients are all it takes to make this recipe so yummy. Autumn will be even more special with this recipe. From preparation to the plate, this recipe takes around 45 minutes. It is brought to you by fullbellysisters.blogspot.com. Overall, this recipe earns an outstanding spoonacular score of 97%. Chilled Cucumber, Avocado, and Yogurt Soup, Chilled Cucumber-Yogurt Soup, and Chilled Cucumber Mint Yogurt Soup are very similar to this recipe.","Butternut Squash Soup (In Half An Hour!) requires about 30 minutes from start to finish. For $1.25 per serving, you get a hor d'oeuvre that serves 8. Watching your figure? This gluten free, dairy free, lacto ovo vegetarian, and vegan recipe has 252 calories, 9g of protein, and 6g of fat per serving. It will be a hit at your Autumn event. 5 people have made this recipe and would make it again. It is brought to you by Foodista. Head to the store and pick up salt and pepper, black-eyed peas, collard greens, and a few other things to make it today. With a spoonacular score of 95%, this dish is great. Try Half-Hour Chili, Half-Hour Chili, and Half-Hour Chili for similar recipes.","The recipe Fish Pie With Fresh and Smoked Salmon can be made in about 45 minutes. One serving contains 725 calories, 47g of protein, and 27g of fat. For $11.0 per serving, this recipe covers 54% of your daily requirements of vitamins and minerals. This recipe serves 2. This recipe from Foodista has 3 fans. A mixture of bay leaf, olive oil, chives, and a handful of other ingredients are all it takes to make this recipe so scrumptious. It is a good option if you're following a gluten free and pescatarian diet. With a spoonacular score of 92%, this dish is awesome. Similar recipes include Potted fresh & smoked salmon, Fresh & smoked salmon rillettes, and Gratin of fresh & smoked salmon, beetroot, potatoes & dill.","Cottage pie with Quorn mince requires approximately 45 minutes from start to finish. For $3.45 per serving, this recipe covers 33% of your daily requirements of vitamins and minerals. One portion of this dish contains approximately 32g of protein, 28g of fat, and a total of 629 calories. This recipe serves 3. Head to the store and pick up canned tomatoes, cumin powder, parsley, and a few other things to make it today. 2 people found this recipe to be delicious and satisfying. It is brought to you by Foodista. With a spoonacular score of 77%, this dish is solid. Cottage pie with Quorn mince, Little mince pie cakes, and Mince Pie Cupcakes are very similar to this recipe.","Polenta Pie With Italian Toppings is a gluten free recipe with 6 servings. One portion of this dish contains around 10g of protein, 22g of fat, and a total of 334 calories. For $1.63 per serving, this recipe covers 21% of your daily requirements of vitamins and minerals. If you have garlic, milk, corn meal, and a few other ingredients on hand, you can make it. 4 people have made this recipe and would make it again. This recipe is typical of Mediterranean cuisine. From preparation to the plate, this recipe takes around 45 minutes. It is brought to you by Foodista. Overall, this recipe earns a solid spoonacular score of 63%. Polenta with Italian Sausage, Italian Sausage with Polenta, and Italian Polenta Casserole are very similar to this recipe.","If you have about 45 minutes to spend in the kitchen, Blackberry Peach Pie might be an amazing dairy free recipe to try. One serving contains 280 calories, 5g of protein, and 3g of fat. For $1.99 per serving, you get a dessert that serves 10. 1 person were impressed by this recipe. If you have ground cinnamon, blackberries, gratings of nutmeg, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. With a spoonacular score of 44%, this dish is solid. Similar recipes are Peach-Blackberry Pie, Peach Blackberry Pie, and Peach-Blackberry Pie.","Summertime Seafood Pie requires roughly 45 minutes from start to finish. This recipe serves 4. One portion of this dish contains roughly 69g of protein, 18g of fat, and a total of 572 calories. For $21.01 per serving, this recipe covers 42% of your daily requirements of vitamins and minerals. This recipe is liked by 1 foodies and cooks. It is a good option if you're following a pescatarian diet. This recipe from Foodista requires kosher salt, eachs sea scallops, flat leaf parsley, and several pepper. Overall, this recipe earns a solid spoonacular score of 50%. Users who liked this recipe also liked Summertime Seafood Nachos with Grilled Corn + Avocado Cream, Summertime Key Lime Pie, and Provencal Seafood Pie.","You can never have too many Mexican recipes, so give Natalie's Strawberry Pie a try. This recipe makes 20 servings with 271 calories, 6g of protein, and 9g of fat each. For $1.87 per serving, this recipe covers 12% of your daily requirements of vitamins and minerals. It will be a hit at your Mother's Day event. Only a few people made this recipe, and 1 would say it hit the spot. If you have condensed milk, cool whip, keebler shortbread crusts, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes approximately 45 minutes. It is brought to you by Foodista. Overall, this recipe earns a pretty good spoonacular score of 55%. Similar recipes include Natalie's Chicken Pot Pie, Natalie's Cajun-Seasoned Pan-Fried Tilapia, and Natalie's Cajun-Seasoned Pan-Fried Tilapia.","If you want to add more gluten free recipes to your recipe box, Beef Cottage Pie might be a recipe you should try. For $1.16 per serving, this recipe covers 13% of your daily requirements of vitamins and minerals. One portion of this dish contains around 16g of protein, 6g of fat, and a total of 198 calories. This recipe serves 8. It is brought to you by Foodista. A mixture of vegetables, garlic, parmesan cheese, and a handful of other ingredients are all it takes to make this recipe so flavorful. 6 people found this recipe to be scrumptious and satisfying. From preparation to the plate, this recipe takes approximately 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 49%, which is solid. Beef Cottage Pie, Chili Beef Cottage Pie, and Roast Beef Cottage Pie are very similar to this recipe.","The recipe SPICY AND SAVORY PUMPKIN PIE can be made in roughly 45 minutes. This dessert has 259 calories, 7g of protein, and 17g of fat per serving. This recipe serves 8. For $1.02 per serving, this recipe covers 8% of your daily requirements of vitamins and minerals. It is brought to you by Foodista. 1 person were impressed by this recipe. It is perfect for Thanksgiving. If you have agave nectar, cayenne pepper, pumpkin puree, and a few other ingredients on hand, you can make it. With a spoonacular score of 42%, this dish is solid. Try Savory Pumpkin Pie, Savory Pumpkin-Walnut Pie, and Savory Pumpkin Pie Soup with Cinnamon Marshmallows, Pepita Streusel, and Whipped Crème Fraîche for similar recipes.","The recipe Classic Pumpkin Pie can be made in approximately 45 minutes. This recipe makes 8 servings with 327 calories, 8g of protein, and 14g of fat each. For $1.03 per serving, this recipe covers 13% of your daily requirements of vitamins and minerals. Thanksgiving will be even more special with this recipe. 2 people found this recipe to be flavorful and satisfying. It is brought to you by Foodista. If you have condensed milk, eggs, ground nutmeg, and a few other ingredients on hand, you can make it. Overall, this recipe earns a solid spoonacular score of 43%. Classic Pumpkin Pie with Pie Crust Tutorial, Classic Pumpkin Pie, and Classic Pumpkin Pie are very similar to this recipe.","Need a gluten free dessert? No-Bake Chocolate Peanut Butter Pie could be a great recipe to try. This recipe serves 8 and costs $1.2 per serving. One portion of this dish contains around 14g of protein, 42g of fat, and a total of 623 calories. 30 people were impressed by this recipe. This recipe from Foodista requires powdered sugar, non-dairy whipped topping, chocolate chips, and roasted peanuts. From preparation to the plate, this recipe takes roughly 45 minutes. With a spoonacular score of 44%, this dish is solid. If you like this recipe, you might also like recipes such as No-Bake Peanut Butter Chocolate Pie, The BEST No Bake Chocolate Peanut Butter Pie, and No bake chocolate and peanut butter pie.","Ground Turkey Stuffed Peppers might be just the main course you are searching for. Watching your figure? This gluten free recipe has 463 calories, 34g of protein, and 17g of fat per serving. This recipe serves 4 and costs $3.0 per serving. 112 people were glad they tried this recipe. A mixture of bell peppers, garlic, onion, and a handful of other ingredients are all it takes to make this recipe so yummy. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 94%, which is spectacular. Try Ground Turkey Stuffed Peppers, Ground Turkey Stuffed Peppers, and Ground Turkey Stuffed Peppers for similar recipes.","The recipe How to Make the Perfect Sweet Potato Sloppy Joes is ready in roughly 40 minutes and is definitely a super gluten free, dairy free, paleolithic, and primal option for lovers of American food. This recipe serves 4. This main course has 679 calories, 49g of protein, and 18g of fat per serving. For $4.82 per serving, this recipe covers 46% of your daily requirements of vitamins and minerals. This recipe from Pink When has 11 fans. Head to the store and pick up salt and pepper, garlic, ground turkey, and a few other things to make it today. All things considered, we decided this recipe deserves a spoonacular score of 93%. This score is awesome. If you like this recipe, take a look at these similar recipes: How to Make the Perfect Sweet Potato Sloppy Joes, Just Perfect Sloppy Joes, and How to Make Classic Sloppy Joes.","Turkey and Rice Stuffed Acorn Squash is a main course that serves 6. One portion of this dish contains approximately 29g of protein, 10g of fat, and a total of 411 calories. For $2.95 per serving, this recipe covers 34% of your daily requirements of vitamins and minerals. A mixture of olive oil, bread crumbs, salt and pepper, and a handful of other ingredients are all it takes to make this recipe so tasty. 35 people were impressed by this recipe. From preparation to the plate, this recipe takes roughly 45 minutes. It is a good option if you're following a dairy free diet. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 93%, which is awesome. Similar recipes include Turkey and Rice Stuffed Acorn Squash, Butternut Squash Noodle Turkey Bolognese Stuffed Acorn Squash with Melted Gruyere: Two Ways, and Butternut Squash Noodle Turkey Bolognese Stuffed Acorn Squash with Melted Gruyere: Two Ways.","You can never have too many main course recipes, so give Turkey Pot Pie a try. This recipe serves 8 and costs $2.06 per serving. One serving contains 728 calories, 23g of protein, and 42g of fat. If you have flour, salt, chicken broth, and a few other ingredients on hand, you can make it. This recipe from Pink When has 17134 fans. From preparation to the plate, this recipe takes around 45 minutes. Overall, this recipe earns a spectacular spoonacular score of 88%. Similar recipes are Curry Turkey Pot Pie With Homemade Butter Pie Crust, Turkey Pot Pie!, and Turkey Pot Pie.","Chipotle Turkey Chili might be just the American recipe you are searching for. This recipe serves 4 and costs $4.81 per serving. This main course has 549 calories, 52g of protein, and 22g of fat per serving. 1 person found this recipe to be scrumptious and satisfying. It is perfect for The Super Bowl. It is brought to you by Foodista. A mixture of chicken stock, garlic, extra virgin olive oil, and a handful of other ingredients are all it takes to make this recipe so yummy. From preparation to the plate, this recipe takes around 45 minutes. It is a good option if you're following a gluten free diet. Taking all factors into account, this recipe earns a spoonacular score of 83%, which is excellent. Try Quick & Easy Chipotle Turkey Chili for a Chili Cook-Off, Chipotle Turkey Chili, and Chipotle Turkey Chili for similar recipes.","The recipe Lentil Soup with Smoked Turkey can be made in around 45 minutes. This main course has 389 calories, 28g of protein, and 12g of fat per serving. For $1.24 per serving, this recipe covers 28% of your daily requirements of vitamins and minerals. This recipe serves 10. It can be enjoyed any time, but it is especially good for Autumn. Only a few people made this recipe, and 1 would say it hit the spot. If you have salt, parmigiano reggiano, lemon zest, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. It is a good option if you're following a gluten free diet. Overall, this recipe earns an awesome spoonacular score of 91%. Lentil Soup with Smoked Turkey, Smoked Turkey-Lentil Soup, and Smoked Turkey and Lentil Vegetable Soup are very similar to this recipe.","You can never have too many side dish recipes, so give Mini Stuffed Mexican Bell Peppers a try. This recipe makes 4 servings with 228 calories, 23g of protein, and 3g of fat each. For $3.38 per serving, this recipe covers 28% of your daily requirements of vitamins and minerals. If you have tomatillos, black beans, canned tomatoes, and a few other ingredients on hand, you can make it. This recipe from Foodista has 7 fans. Only a few people really liked this Mexican dish. From preparation to the plate, this recipe takes approximately 45 minutes. It is a good option if you're following a gluten free and dairy free diet. Overall, this recipe earns a great spoonacular score of 95%. Mexican Stuffed Bell Peppers, Mexican Stuffed Bell Peppers, and Goat Cheese Stuffed Mini Bell Peppers are very similar to this recipe.","La Bellan Italian Turkey Burger is an American main course. This recipe serves 4. One serving contains 846 calories, 64g of protein, and 51g of fat. For $5.65 per serving, this recipe covers 50% of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes approximately 30 minutes. 2 people have tried and liked this recipe. It is brought to you by Foodista. A mixture of pine nuts, bell pepper, basil, and a handful of other ingredients are all it takes to make this recipe so tasty. Overall, this recipe earns a spectacular spoonacular score of 84%. Turkey & Baby Bellan Asian Lettuce Wraps, Italian Burger, and Italian Meatball Burger are very similar to this recipe.","Turkey Enchilada Bake is a gluten free main course. This recipe serves 8 and costs $2.73 per serving. One portion of this dish contains approximately 26g of protein, 31g of fat, and a total of 517 calories. This recipe is typical of Mexican cuisine. 31 person were glad they tried this recipe. This recipe from Foodista requires juice of lime, canned tomatoes, chili powder, and cilantro. From preparation to the plate, this recipe takes approximately 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 81%. This score is awesome. Similar recipes are Roasted Turkey Enchilada Bake, Roasted Turkey Enchilada Bake, and Carrot and Turkey Enchilada Bake.","Turkey Kale Tacos takes roughly 45 minutes from beginning to end. For $2.72 per serving, this recipe covers 34% of your daily requirements of vitamins and minerals. Watching your figure? This gluten free, dairy free, paleolithic, and primal recipe has 196 calories, 29g of protein, and 7g of fat per serving. This recipe serves 4. Only a few people made this recipe, and 1 would say it hit the spot. This recipe is typical of Mexican cuisine. It works well as a main course. It is brought to you by Pick Fresh Foods. A mixture of paprika, olive oil, ground turkey, and a handful of other ingredients are all it takes to make this recipe so tasty. Taking all factors into account, this recipe earns a spoonacular score of 84%, which is awesome. Similar recipes are Turkey Chorizo and Potato Tacos, Breakfast Tacos, and Alouette Crumbled Goat Cheese Provencal Mini Tacos.","Plantain Pizzan is a Mediterranean main course. One serving contains 657 calories, 27g of protein, and 23g of fat. This dairy free recipe serves 3 and costs $1.47 per serving. 95 people were impressed by this recipe. It is brought to you by Afrolems. If you have tomato), bell pepper, bell peppers, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 91%. This score is outstanding. Similar recipes include How to Spiralize a Plantain & Plantain “Rice” and Beans, Plantain Chips, and Plantain Fritters.","If you want to add more Mediterranean recipes to your recipe box, Homemade Thin Crust Pizza + Pesto + Potato might be a recipe you should try. This recipe makes 6 servings with 515 calories, 16g of protein, and 19g of fat each. For $2.0 per serving, this recipe covers 30% of your daily requirements of vitamins and minerals. Head to the store and pick up water, basil, manchego cheese, and a few other things to make it today. This recipe is liked by 1 foodies and cooks. Not a lot of people really liked this main course. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 85%. This score is excellent. If you like this recipe, take a look at these similar recipes: Thin Crust Pizza, Thin Crust Pizza, and Explorers Thin Crust Pizza.","Pesto Veggie Pizza requires about 45 minutes from start to finish. This recipe serves 4 and costs $2.62 per serving. One serving contains 826 calories, 32g of protein, and 37g of fat. A mixture of flour, tsp garlic powder, olives, and a handful of other ingredients are all it takes to make this recipe so yummy. This recipe is liked by 1 foodies and cooks. It is brought to you by Foodista. Only a few people really liked this Mediterranean dish. It works well as a main course. With a spoonacular score of 77%, this dish is solid. Similar recipes are Veggie Pesto Pizza, Pesto Veggie Pizza, and Veggie Pesto Pizza.","Thin Crust Genoa Salami Pizzan is a Mediterranean main course. One portion of this dish contains around 19g of protein, 13g of fat, and a total of 477 calories. This recipe serves 4. For $1.36 per serving, this recipe covers 23% of your daily requirements of vitamins and minerals. A mixture of all purpose flour, olive oil, ground pepper, and a handful of other ingredients are all it takes to make this recipe so tasty. 1 person were glad they tried this recipe. From preparation to the plate, this recipe takes around 45 minutes. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 77%, which is pretty good. Users who liked this recipe also liked Thin Crust Genoa Salami Pizza, Genoa Salami Stacks, and Sopressatan And Genoa Salami Calzones.","The recipe Elk Italian Sausage Pizza With Ricotta Cheese, Sautéd Mushrooms and Onion could satisfy your Mediterranean craving in around 45 minutes. For $5.65 per serving, this recipe covers 34% of your daily requirements of vitamins and minerals. This recipe serves 4. One serving contains 745 calories, 54g of protein, and 30g of fat. This recipe from Foodista requires elk sausage, shitake mushrooms, garlic, and parmesan cheese. It works well as a pricey main course. 1 person has made this recipe and would make it again. With a spoonacular score of 65%, this dish is pretty good. If you like this recipe, you might also like recipes such as Italian Sausage & Caramelized Onion Pizza, Fast and Easy Ricotta Cheese Pizza with Mushrooms, Broccoli, and Chicken, and Italian Sausage, Spinach and Ricotta Cheese Stuffed Shells.","The recipe Buffalo Mozzarella & Pepperoni Pizza with a Cauliflower Crust is ready in roughly 45 minutes and is definitely an awesome gluten free and primal option for lovers of Mediterranean food. One portion of this dish contains approximately 33g of protein, 41g of fat, and a total of 611 calories. For $6.39 per serving, you get a main course that serves 2. A mixture of tomato, egg, pepperoni, and a handful of other ingredients are all it takes to make this recipe so tasty. 1 person has tried and liked this recipe. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 76%. This score is solid. Try Cauliflower Crust Pizza with Chickpea \"Pepperoni, Cauliflower-Crust Pizza With Tomatoes and Mozzarella, and Buffalo Chicken and Caramelized Onions Pizzan on Cauliflower Crust for similar recipes.","You can never have too many Mediterranean recipes, so give summer vegetable pizzan a try. One portion of this dish contains roughly 27g of protein, 20g of fat, and a total of 614 calories. This recipe serves 4 and costs $4.01 per serving. This recipe is liked by 2 foodies and cooks. This recipe from Foodista requires pepper, onion, thyme, and eggplant. It works best as a main course, and is done in roughly 45 minutes. The Fourth Of July will be even more special with this recipe. Overall, this recipe earns a good spoonacular score of 69%. Try Summer Grilled Vegetable Pizza, Summer Vegetable Pizza with a Cauliflower Crust, and Summer Time Vegetable Pizza Pie for similar recipes.","The recipe Butternut Squash Pizza can be made in roughly 45 minutes. This main course has 925 calories, 46g of protein, and 51g of fat per serving. This recipe serves 4 and costs $4.76 per serving. This recipe is typical of Mediterranean cuisine. A mixture of mozzarella cheese, roasted butternut squash, pine nuts, and a handful of other ingredients are all it takes to make this recipe so scrumptious. 2 people have made this recipe and would make it again. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 61%. This score is solid. Similar recipes are 2ways2percent: Butternut Squash Pizzan and Creamy Butternut Squash Puree with Scallops and Bacon, 2ways2percent: Butternut Squash Pizzan and Creamy Butternut Squash Puree with Scallops and Bacon, and Butternut Squash Pizza.","Mini Vegetarian Puff Pastry Pizzas could be just the lacto ovo vegetarian recipe you've been looking for. For $1.93 per serving, this recipe covers 16% of your daily requirements of vitamins and minerals. This recipe makes 12 servings with 435 calories, 12g of protein, and 30g of fat each. If you have puff pastry, arugula, aubergine, and a few other ingredients on hand, you can make it. 1 person found this recipe to be tasty and satisfying. It works well as a main course. It is brought to you by Foodista. From preparation to the plate, this recipe takes approximately 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 42%, which is solid. If you like this recipe, take a look at these similar recipes: Mini Strawberry Puff Pastry Braids, Lemon Raspberry Mini Puff Pastry Tarts, and Lemon Raspberry Mini Puff Pastry Tarts.","Tomato and Bacon Pizza With Rice Crust is a hor d'oeuvre that serves 8. One serving contains 163 calories, 9g of protein, and 7g of fat. For 81 cents per serving, this recipe covers 10% of your daily requirements of vitamins and minerals. 3 people have tried and liked this recipe. From preparation to the plate, this recipe takes roughly 45 minutes. This recipe from Foodista requires bell pepper, tomatoes, egg, and mozzarella cheese. Not a lot of people really liked this Mediterranean dish. It is a good option if you're following a gluten free diet. With a spoonacular score of 52%, this dish is pretty good. Similar recipes include Tomato and Bacon Pizza With Rice Crust, Thin Crust Bacon Cheeseburger Pizza, and Cauliflower Crust Bacon and Egg Pizza.","Red Kidney Bean Jambalayan is a main course that serves 6. One portion of this dish contains approximately 18g of protein, 6g of fat, and a total of 393 calories. For $1.68 per serving, this recipe covers 33% of your daily requirements of vitamins and minerals. 53 people were glad they tried this recipe. A mixture of vegetable stock, tomatoes, onion, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. This recipe is typical of Cajun cuisine. It is brought to you by foodandspice.blogspot.com. From preparation to the plate, this recipe takes roughly 45 minutes. Overall, this recipe earns a tremendous spoonacular score of 99%. Users who liked this recipe also liked Red Kidney Bean Jambalaya, Red Kidney Bean Salad, and Red Kidney Bean Curry.","Need a gluten free, dairy free, and vegetarian side dish? Quinoan and Chickpea Salad with Sun-Dried Tomatoes and Dried Cherries could be an awesome recipe to try. This recipe serves 6 and costs $1.87 per serving. One serving contains 539 calories, 21g of protein, and 15g of fat. 34 people have made this recipe and would make it again. Head to the store and pick up honey, juice of orange, chickpeas, and a few other things to make it today. From preparation to the plate, this recipe takes about 45 minutes. It is brought to you by foodandspice.blogspot.com. Taking all factors into account, this recipe earns a spoonacular score of 99%, which is spectacular. Chickpean and Cucumber Salad with Dried Cherries and Cheese, Spinach Quiche with Sun-Dried Tomatoes, and Quinoa Salad With Dried Tart Cherries, Mint, and Fetan in Lemon-Sumac Vinaigrette are very similar to this recipe.","Easy Homemade Rice and Beans is a main course that serves 2. One serving contains 446 calories, 19g of protein, and 4g of fat. For $1.06 per serving, this recipe covers 26% of your daily requirements of vitamins and minerals. A mixture of optional: of hot sauce, canned tomatoes, water, and a handful of other ingredients are all it takes to make this recipe so yummy. This recipe from cooking2perfection.blogspot.com has 471 fans. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. From preparation to the plate, this recipe takes around 35 minutes. Overall, this recipe earns a tremendous spoonacular score of 98%. Easy Homemade Rice and Beans, Easy Homemade Rice and Beans, and Easy Homemade Rice and Beans are very similar to this recipe.","Slow Cooker: Pork and Garbanzo Beans takes approximately 45 minutes from beginning to end. This recipe serves 6. This main course has 587 calories, 66g of protein, and 14g of fat per serving. For $2.99 per serving, this recipe covers 45% of your daily requirements of vitamins and minerals. Head to the store and pick up water *2, cumin, pork should roast, and a few other things to make it today. This recipe is liked by 22 foodies and cooks. It is brought to you by Foodista. It is a good option if you're following a gluten free and dairy free diet. With a spoonacular score of 96%, this dish is outstanding. Similar recipes include Slow Cooker Pork and Beans, Slow Cooker Pork and Beans, and Slow Cooker Pork and Beans.","Broccolini Quinoa Pilaf requires approximately 30 minutes from start to finish. For $4.14 per serving, you get a main course that serves 2. One portion of this dish contains around 20g of protein, 31g of fat, and a total of 625 calories. Head to the store and pick up vegetable broth, onion, olive oil, and a few other things to make it today. A few people made this recipe, and 94 would say it hit the spot. It is a rather expensive recipe for fans of Mediterranean food. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. It is brought to you by Pick Fresh Foods. With a spoonacular score of 98%, this dish is excellent. Similar recipes are Spring Broccolini & Kale Quinoa Bowls, Orange-Sesame Salmon with Quinoa & Broccolini, and Black Pepper Goat Cheese and Chard Quinoa with Roasted Broccolini.","The recipe Butternut Squash Frittata can be made in approximately 45 minutes. This recipe serves 1. Watching your figure? This gluten free recipe has 465 calories, 24g of protein, and 4g of fat per serving. For $3.4 per serving, this recipe covers 53% of your daily requirements of vitamins and minerals. A few people really liked this main course. This recipe from Foodista requires butternut squash, bell pepper, liquid egg substitute, and non-fat milk. 18 people have tried and liked this recipe. Overall, this recipe earns an awesome spoonacular score of 98%. If you like this recipe, you might also like recipes such as Butternut Squash Frittata, Butternut Squash Frittata, and Butternut Squash and Quinoa Frittata.","Need a gluten free, dairy free, paleolithic, and primal main course? Jade Buddha Salmon Tartare could be an outstanding recipe to try. This recipe serves 2 and costs $6.96 per serving. One serving contains 382 calories, 34g of protein, and 25g of fat. If you have olive oil to coat, green onion, salt and pepper, and a few other ingredients on hand, you can make it. 28 people were glad they tried this recipe. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly 45 minutes. Overall, this recipe earns an awesome spoonacular score of 97%. If you like this recipe, you might also like recipes such as Salmon Tartare, Salmon Tartare, and Salmon Tartare.","Mango Fried Rice is a Chinese main course. This recipe makes 2 servings with 486 calories, 16g of protein, and 4g of fat each. For $1.51 per serving, this recipe covers 19% of your daily requirements of vitamins and minerals. Several people made this recipe, and 262 would say it hit the spot. Head to the store and pick up scotch bonnet pepper, seasoning cubes, rice, and a few other things to make it today. From preparation to the plate, this recipe takes roughly 45 minutes. It is brought to you by Afrolems. It is a good option if you're following a gluten free and dairy free diet. Overall, this recipe earns a great spoonacular score of 94%. Mango-Pork Fried Rice, Thai Beef & Mango Fried Rice, and Thai Chicken and Mango Fried Rice are very similar to this recipe.","Spicy Salad with Kidney Beans, Cheddar, and Nuts might be just the main course you are searching for. One serving contains 719 calories, 27g of protein, and 49g of fat. This recipe serves 1 and costs $4.58 per serving. It is a good option if you're following a gluten free and lacto ovo vegetarian diet. Head to the store and pick up almonds, greens, sundried tomatoes, and a few other things to make it today. From preparation to the plate, this recipe takes about 10 minutes. It is brought to you by spoonacular user coffeebean. If you like this recipe, take a look at these similar recipes: Curried Red Kidney Beans with Paneer (Paneer Rajma), Steak and Kidney Pie With Port and Pickled Walnuts, and LAMB AND KIDNEY HOT- POT.","Greek-Style Baked Fish: Fresh, Simple, and Delicious might be just the Mediterranean recipe you are searching for. For $3.04 per serving, this recipe covers 21% of your daily requirements of vitamins and minerals. One portion of this dish contains roughly 28g of protein, 12g of fat, and a total of 343 calories. This recipe serves 4. Plenty of people made this recipe, and 396 would say it hit the spot. It works well as a main course. Head to the store and pick up pepper, white wine, basil, and a few other things to make it today. From preparation to the plate, this recipe takes roughly 30 minutes. It is a good option if you're following a gluten free and pescatarian diet. It is brought to you by fullbellysisters.blogspot.com. Overall, this recipe earns a tremendous spoonacular score of 98%. Similar recipes are Simple Greek Style Baked Fish, Greek Style Baked Fish, and Delicious Greek Pastitsio {Casserole-Style}.","Salmon with roasted vegetables takes approximately 45 minutes from beginning to end. For $5.2 per serving, this recipe covers 45% of your daily requirements of vitamins and minerals. This recipe serves 2. One serving contains 496 calories, 39g of protein, and 18g of fat. Head to the store and pick up lemon juice, salt, carrot, and a few other things to make it today. Not a lot of people made this recipe, and 7 would say it hit the spot. It works well as a main course. It is a good option if you're following a gluten free, dairy free, whole 30, and pescatarian diet. It is brought to you by Foodista. Overall, this recipe earns a great spoonacular score of 94%. If you like this recipe, take a look at these similar recipes: Roasted Salmon & Vegetables, Roasted Salmon & Vegetables, and Salmon with roasted vegetables.","If you want to add more gluten free, dairy free, and whole 30 recipes to your collection, Cod with Tomato-Olive-Chorizo Sauce and Mashed Potatoes might be a recipe you should try. This recipe serves 2 and costs $6.26 per serving. This main course has 733 calories, 56g of protein, and 40g of fat per serving. This recipe is liked by 14 foodies and cooks. Head to the store and pick up lemon juice, parsley leaves, parsley, and a few other things to make it today. It is perfect for Thanksgiving. It is brought to you by Foodista. From preparation to the plate, this recipe takes approximately 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 96%. This score is awesome. If you like this recipe, you might also like recipes such as Cod Stew With Chorizo, Leeks & Potatoes, Tuna Steaks In Spicy Tomato Sauce With Mashed Potatoes, and Tuna Steaks In Spicy Tomato Sauce With Mashed Potatoes.","If you want to add more gluten free, dairy free, and pescatarian recipes to your recipe box, Balsamic & Honey Glazed Salmon with Lemony Asparagus might be a recipe you should try. For $4.44 per serving, this recipe covers 26% of your daily requirements of vitamins and minerals. One portion of this dish contains approximately 25g of protein, 14g of fat, and a total of 301 calories. This recipe serves 2. 28 people were impressed by this recipe. From preparation to the plate, this recipe takes roughly 1 hour. It is brought to you by Foodista. It works well as a pretty expensive main course. Head to the store and pick up juice of lemon, herbs de provence, salmon fillet, and a few other things to make it today. Taking all factors into account, this recipe earns a spoonacular score of 96%, which is great. If you like this recipe, take a look at these similar recipes: Balsamic & Honey Glazed Salmon with Lemony Asparagus, Balsamic & Honey Glazed Salmon with Lemony Asparagus, and Balsamic & Honey Glazed Salmon with Lemony Asparagus.","Instant Pot Quinoa Grain Bowl might be a good recipe to expand your main course recipe box. Watching your figure? This gluten free, dairy free, lacto ovo vegetarian, and vegan recipe has 416 calories, 16g of protein, and 10g of fat per serving. This recipe serves 4 and costs $3.02 per serving. From preparation to the plate, this recipe takes roughly 13 minutes. A mixture of baby brussell sprouts, broccoli, salt and pepper, and a handful of other ingredients are all it takes to make this recipe so tasty. 1 person has made this recipe and would make it again. It is brought to you by Pink When. With a spoonacular score of 96%, this dish is super. Users who liked this recipe also liked Instant Pot Quinoa Grain Bowl, Instant Pot Sausage Cabbage Bowl with Quinoa (or Stovetop), and Crock Pot Chicken Fajita Bowl (Grain-Free, Paleo).","Roasted Cauliflower Detox Bowl with Tahini Sauce might be just the main course you are searching for. One serving contains 549 calories, 18g of protein, and 30g of fat. This recipe serves 2 and costs $3.06 per serving. 1 person were glad they tried this recipe. A mixture of kale leaves, garlic, ground cumin, and a handful of other ingredients are all it takes to make this recipe so yummy. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. From preparation to the plate, this recipe takes around 50 minutes. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 95%. This score is awesome. Quinoa Bowl with Roasted Cauliflower and Tahini Dressing, Quinoa Bowl with Roasted Cauliflower and Tahini Dressing, and Roasted Cauliflower with Tahini Sauce are very similar to this recipe.","Chorizo and Beef Quinoa Stuffed Pepper is a gluten free main course. One portion of this dish contains approximately 51g of protein, 37g of fat, and a total of 685 calories. This recipe serves 4 and costs $3.69 per serving. Plenty of people made this recipe, and 1254 would say it hit the spot. It is brought to you by Pink When. If you have bell peppers, chorizo, chili powder, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes approximately 30 minutes. With a spoonacular score of 93%, this dish is super. Similar recipes include Pepper-Stuffed Peppers with Chorizo, Chorizo & Red Pepper Stuffed Potatoes With Roasted Garlic Aioli, and QUINOAn AND GROUND TURKEY STUFFED PEPPER.","Need a gluten free and dairy free main course? Coffee-braised Short Ribs could be a great recipe to try. One portion of this dish contains approximately 74g of protein, 42g of fat, and a total of 877 calories. For $7.05 per serving, this recipe covers 64% of your daily requirements of vitamins and minerals. This recipe serves 5. 6 people have made this recipe and would make it again. A mixture of strong freshly coffee, short, brown sugar, and a handful of other ingredients are all it takes to make this recipe so delicious. From preparation to the plate, this recipe takes approximately 45 minutes. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 90%, which is spectacular. If you like this recipe, take a look at these similar recipes: Coffee-Braised Short Ribs, Coffee-braised Short Ribs, and Coffee-Braised Short Ribs.","Lentil Mango Salad is a main course that serves 4. One serving contains 253 calories, 12g of protein, and 6g of fat. For $1.59 per serving, this recipe covers 25% of your daily requirements of vitamins and minerals. It is brought to you by Foodista. 3 people found this recipe to be tasty and satisfying. From preparation to the plate, this recipe takes around 45 minutes. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. Head to the store and pick up cilantro, white wine vinegar, onion, and a few other things to make it today. Taking all factors into account, this recipe earns a spoonacular score of 94%, which is amazing. Users who liked this recipe also liked LENTIL BURGER with Mango Salsa, Plumcot, Orange & Lentil Salad… & Fave Five Friday: Lovely Lentil Dishes, and Simple Coconut Quinoan and Lentil Curry with Lime Mango.","Gujarati Dry Mung Bean Curry takes about 45 minutes from beginning to end. This main course has 376 calories, 20g of protein, and 5g of fat per serving. This recipe serves 4 and costs $1.64 per serving. A mixture of baking powder, cumin seeds, garlic, and a handful of other ingredients are all it takes to make this recipe so flavorful. This recipe from Foodista has 3 fans. This recipe is typical of Indian cuisine. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. Taking all factors into account, this recipe earns a spoonacular score of 95%, which is outstanding. Gujarati Dry Mung Bean Curry, Gujarati Dry Mung Bean Curry, and Uncle Bill's Mung Bean Curry are very similar to this recipe.","Moosewood Lentil Soup might be a good recipe to expand your main course recipe box. This gluten free, dairy free, lacto ovo vegetarian, and vegan recipe serves 6 and costs 74 cents per serving. One portion of this dish contains roughly 26g of protein, 4g of fat, and a total of 396 calories. A mixture of pepper, lentils, salt, and a handful of other ingredients are all it takes to make this recipe so yummy. 2 people found this recipe to be flavorful and satisfying. It is perfect for Autumn. From preparation to the plate, this recipe takes roughly 45 minutes. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 95%. This score is spectacular. Similar recipes are Moosewood Lentil Soup, Moosewood Mushroom Barley Soup!, and Hungarian Mushroom Soup, from the Moosewood Cookbook.","Crispy Panko and Herb Crusted Salmon takes around 45 minutes from beginning to end. For $4.16 per serving, this recipe covers 31% of your daily requirements of vitamins and minerals. This recipe serves 6. One serving contains 390 calories, 33g of protein, and 22g of fat. This recipe from Foodista has 4 fans. If you have lemon zest, extra virgin olive oil, bell pepper, and a few other ingredients on hand, you can make it. It works well as a main course. It is a good option if you're following a dairy free and pescatarian diet. With a spoonacular score of 93%, this dish is super. Similar recipes are Dijon and Herb Panko-Crusted Halibut, Mustard-Herb Panko Crusted Chicken Breasts, and Panko Herb Crusted Rack of Lamb with Vegetables.","Cilantro Lime Halibut might be a good recipe to expand your main course recipe box. This recipe serves 2. One portion of this dish contains roughly 44g of protein, 22g of fat, and a total of 422 calories. For $8.81 per serving, this recipe covers 29% of your daily requirements of vitamins and minerals. This recipe from Foodista requires chicken stock, juice of lime, green onions, and salt and pepper. 19 people found this recipe to be delicious and satisfying. From preparation to the plate, this recipe takes around 45 minutes. It is a good option if you're following a gluten free, dairy free, paleolithic, and primal diet. Overall, this recipe earns an outstanding spoonacular score of 95%. Similar recipes are Cilantro-Ginger Halibut, Cilantro-Ginger Halibut, and Halibut With Citrus And Cilantro.","Spinach and Gorgonzola Stuffed Flank Steak might be just the main course you are searching for. For $4.27 per serving, this recipe covers 39% of your daily requirements of vitamins and minerals. One portion of this dish contains approximately 47g of protein, 28g of fat, and a total of 523 calories. This recipe serves 4. 9 people found this recipe to be tasty and satisfying. It is perfect for valentin day. If you have gorgonzola, olive oil, shallot, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes roughly 45 minutes. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 95%, which is super. If you like this recipe, you might also like recipes such as Bruce Aidells' Spinach and Gorgonzola-Stuffed Flank Steak, Spinach-stuffed Flank Steak, and Spinach and Carrot Stuffed Flank Steak.","Need a gluten free, dairy free, and pescatarian main course? Shrimp and Avocado Salad could be an awesome recipe to try. This recipe serves 4 and costs $11.57 per serving. One portion of this dish contains about 34g of protein, 37g of fat, and a total of 639 calories. From preparation to the plate, this recipe takes about 45 minutes. This recipe is liked by 8 foodies and cooks. This recipe from Foodista requires the shrimp, salt and pepper, garlic cloves, and the dressing. All things considered, we decided this recipe deserves a spoonacular score of 86%. This score is outstanding. If you like this recipe, take a look at these similar recipes: Shrimp, Corn & Californian Avocado Pasta Salad & a CAn Avocado Trip, Shrimp, Corn & Californian Avocado Pasta Salad & a CAn Avocado Trip, and Shrimp, Corn & Californian Avocado Pasta Salad & a CAn Avocado Trip.","Salmon Quinoa Risotto might be just the main course you are searching for. One serving contains 437 calories, 25g of protein, and 20g of fat. This recipe serves 4. For $3.83 per serving, this recipe covers 43% of your daily requirements of vitamins and minerals. Head to the store and pick up quinoa, poached salmon, olive oil, and a few other things to make it today. It is a good option if you're following a gluten free, dairy free, and pescatarian diet. It is a rather expensive recipe for fans of Mediterranean food. 3 people found this recipe to be yummy and satisfying. From preparation to the plate, this recipe takes roughly 45 minutes. It is brought to you by Foodista. Overall, this recipe earns an outstanding spoonacular score of 94%. Similar recipes include Salmon Quinoa Risotto, Salmon Quinoa Risotto, and Quinoa Risotto With Salmon And Kale.","Easy Instant Pot Beef Tips and Rice takes around 30 minutes from beginning to end. Watching your figure? This gluten free and dairy free recipe has 371 calories, 53g of protein, and 11g of fat per serving. This recipe serves 4 and costs $2.2 per serving. 25 people have made this recipe and would make it again. Head to the store and pick up dale's seasoning sauce, onion, olive oil, and a few other things to make it today. It works well as a main course. It is brought to you by Pink When. Overall, this recipe earns a super spoonacular score of 93%. Users who liked this recipe also liked Instant Pot Beef Tips, Instant Pot Beef Tips, and Instant Pot Red Wine Beef Tips.","Venison Stew is a dairy free main course. This recipe serves 7. One serving contains 316 calories, 32g of protein, and 7g of fat. For $2.02 per serving, this recipe covers 30% of your daily requirements of vitamins and minerals. It can be enjoyed any time, but it is especially good for Autumn. 3 people found this recipe to be tasty and satisfying. Head to the store and pick up venison stew meat, baby carrots, bell pepper, and a few other things to make it today. From preparation to the plate, this recipe takes roughly 45 minutes. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 86%. This score is tremendous. Similar recipes include Venison Bourguignon (Venison Stew), Venison Stew, and Venison Stew.","Salmon, Watercress, Fennel and Baby Beetroot Salad With Lemony \"Caviar\" Dressing might be a good recipe to expand your main course recipe box. One portion of this dish contains approximately 27g of protein, 29g of fat, and a total of 440 calories. This recipe serves 4 and costs $4.28 per serving. A mixture of white wine, baby beets, watercress, and a handful of other ingredients are all it takes to make this recipe so delicious. Not a lot of people made this recipe, and 4 would say it hit the spot. It is brought to you by Foodista. From preparation to the plate, this recipe takes about 45 minutes. It is a good option if you're following a gluten free, dairy free, paleolithic, and primal diet. With a spoonacular score of 95%, this dish is super. If you like this recipe, you might also like recipes such as Wild Rice, Baby Beetroot & Beef Kofta Salad (ft. Love Beets Baby Beetroot), Poached Salmon and Watercress Salad with Dill-Yogurt Dressing, and Beetroot, Red Apple And Watercress Salad.","Rice and Peas with Coconut Curry Mackerel could be just the gluten free and dairy free recipe you've been looking for. For $2.44 per serving, you get a main course that serves 4. One serving contains 625 calories, 31g of protein, and 34g of fat. This recipe from Afrolems has 26 fans. From preparation to the plate, this recipe takes around 45 minutes. If you have coconut milk, corn starch, garlic, and a few other ingredients on hand, you can make it. A couple people really liked this Indian dish. All things considered, we decided this recipe deserves a spoonacular score of 94%. This score is super. Similar recipes are Rice and Peas with Coconut Curry Mackerel, Coconut Chicken Curry with Snow Peas and Rice, and Black Eyed Peas Curry (With Coconut) (Lobia Curry).","If you have about 45 minutes to spend in the kitchen, Penne Arrabiata might be an outstanding dairy free, lacto ovo vegetarian, and vegan recipe to try. One serving contains 466 calories, 15g of protein, and 9g of fat. For $1.05 per serving, you get a main course that serves 4. A mixture of tomato, peppers, pkt penne, and a handful of other ingredients are all it takes to make this recipe so scrumptious. 2 people found this recipe to be tasty and satisfying. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 94%, which is awesome. If you like this recipe, take a look at these similar recipes: Penne Arrabiata, Penne Arrabiata, and Penne Arrabiata.","Delicious Creamy Lentils and Chestnuts Soup takes approximately 30 minutes from beginning to end. This recipe serves 4. For 80 cents per serving, this recipe covers 26% of your daily requirements of vitamins and minerals. Watching your figure? This gluten free, dairy free, lacto ovo vegetarian, and vegan recipe has 452 calories, 20g of protein, and 15g of fat per serving. Only a few people made this recipe, and 1 would say it hit the spot. If you have olive oil, roasted chestnuts, salt and pepper, and a few other ingredients on hand, you can make it. It works well as a very budget friendly main course for Autumn. It is brought to you by Foodista. Overall, this recipe earns an outstanding spoonacular score of 94%. If you like this recipe, take a look at these similar recipes: Creamy Spinach Dip with Water Chestnuts, Creamy Vegan Mushroom Tartlets with Chestnuts, and Pumpkin Soup With Cranberry Compote And Roasted Chestnuts.","If you want to add more gluten free, dairy free, paleolithic, and primal recipes to your collection, Chimichurri Skirt Steak with Grilled Asparagus might be a recipe you should try. For $4.9 per serving, you get a main course that serves 4. One portion of this dish contains around 27g of protein, 30g of fat, and a total of 409 calories. This recipe is liked by 11 foodies and cooks. Head to the store and pick up pepper, chili pepper flakes, to 5 garlic cloves, and a few other things to make it today. From preparation to the plate, this recipe takes around 45 minutes. A couple people really liked this Latin American dish. The Fourth Of July will be even more special with this recipe. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 94%. This score is great. Chimichurri Skirt Steak with Grilled Asparagus, Chimichurri Skirt Steak with Grilled Asparagus, and Chimichurri Skirt Steak with Grilled Asparagus are very similar to this recipe.","Peppery Absorption-Cooked Red-Wine Capellini is a dairy free recipe with 4 servings. One serving contains 681 calories, 21g of protein, and 13g of fat. For $3.94 per serving, this recipe covers 36% of your daily requirements of vitamins and minerals. 4 people were impressed by this recipe. It works well as a pretty expensive main course. It is brought to you by Foodista. If you have cayenne pepper, flat parsley leaves, half alarge onion, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes roughly 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 92%. This score is tremendous. Users who liked this recipe also liked Slow Cooked Lamb Shanks in Red Wine, Slow Cooked Lamb Shanks in Red Wine, and Peposo - Slow Cooked, Peppery Veal Stew.","If you want to add more dairy free, lacto ovo vegetarian, and vegan recipes to your recipe box, Easy Tabouleh might be a recipe you should try. This main course has 717 calories, 14g of protein, and 44g of fat per serving. This recipe serves 1 and costs $4.64 per serving. From preparation to the plate, this recipe takes around 45 minutes. 2 people were impressed by this recipe. It is a pretty expensive recipe for fans of middl eastern food. This recipe from Foodista requires bulgur, olive oil, flat leaf parsley, and salt. Taking all factors into account, this recipe earns a spoonacular score of 93%, which is spectacular. Easy Tabouleh, Tabouleh, and Tabouleh are very similar to this recipe.","If you want to add more middl eastern recipes to your repertoire, Winter Fattoush Salad might be a recipe you should try. This main course has 345 calories, 17g of protein, and 9g of fat per serving. This lacto ovo vegetarian recipe serves 6 and costs $1.23 per serving. 1 person found this recipe to be scrumptious and satisfying. This recipe from Foodista requires ground sumac, feta cheese, lacinato kale leaves, and garlic. It will be a hit at your Winter event. From preparation to the plate, this recipe takes approximately 45 minutes. With a spoonacular score of 93%, this dish is super. If you like this recipe, take a look at these similar recipes: Winter Fattoush Salad, Fattoush Salad, and Fattoush Salad.","The recipe Cauliflower Chickpea Stew can be made in roughly 45 minutes. One portion of this dish contains about 14g of protein, 8g of fat, and a total of 455 calories. For $1.4 per serving, this recipe covers 29% of your daily requirements of vitamins and minerals. This recipe serves 4. It can be enjoyed any time, but it is especially good for Autumn. 2 people have tried and liked this recipe. If you have chili, onion, tumeric, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. It works well as a main course. With a spoonacular score of 92%, this dish is amazing. Try Cauliflower Chickpea Stew, Spicy Cauliflower And Chickpea Stew, and Curried Cauliflower And Chickpea Stew for similar recipes.","If you want to add more dairy free recipes to your recipe box, The Secret to the Best Ever Instant Pot Lamb Stew might be a recipe you should try. This recipe makes 8 servings with 354 calories, 35g of protein, and 10g of fat each. For $2.66 per serving, this recipe covers 34% of your daily requirements of vitamins and minerals. 1 person has made this recipe and would make it again. It is brought to you by Pink When. It will be a hit at your Autumn event. If you have sweet potatoes, thyme and rosemary, potatoes, and a few other ingredients on hand, you can make it. It works well as a main course. From preparation to the plate, this recipe takes around 40 minutes. All things considered, we decided this recipe deserves a spoonacular score of 92%. This score is awesome. If you like this recipe, you might also like recipes such as Instant Pot Lamb Stew, Instant Pot Middle Eastern Lamb Stew, and Beef Stew with Butternut Squash (Instant Pot, Stove Top or Crock Pot).","You can never have too many main course recipes, so give Kale and Roasted Sweet Potato Soup with Chicken Sausage a try. One portion of this dish contains around 21g of protein, 26g of fat, and a total of 529 calories. This recipe serves 4 and costs $2.93 per serving. This recipe from Foodista has 2 fans. It is perfect for Autumn. It is a good option if you're following a gluten free, dairy free, paleolithic, and primal diet. If you have thyme, olive oil, chili flakes, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes approximately 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 89%. This score is outstanding. Kale and Roasted Sweet Potato Soup with Chicken Sausage, Kale and Roasted Sweet Potato Soup with Chicken Sausage, and Sweet Potato, Sausage & Kale Soup are very similar to this recipe.","If you want to add more gluten free, dairy free, paleolithic, and primal recipes to your recipe box, Authentic Jamaican Curry Chicken might be a recipe you should try. This recipe serves 4. For $4.02 per serving, this recipe covers 46% of your daily requirements of vitamins and minerals. This main course has 587 calories, 70g of protein, and 19g of fat per serving. 4 people have made this recipe and would make it again. Not a lot of people really liked this Indian dish. This recipe from Foodista requires thyme, scallions, scotch bonnet pepper, and sweet potatoes. From preparation to the plate, this recipe takes about 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 87%. This score is great. Try Authentic Jamaican Curry Chicken, Authentic Jamaican Curry Chicken, and Authentic Jamaican Brown Stew Chicken for similar recipes.","If you want to add more pescatarian recipes to your collection, Salmon with Lime Crust, Peas, and Sweet Potatoes might be a recipe you should try. This recipe serves 4. For $4.7 per serving, this recipe covers 43% of your daily requirements of vitamins and minerals. One portion of this dish contains roughly 41g of protein, 17g of fat, and a total of 497 calories. Not a lot of people really liked this main course. This recipe from Foodista has 1 fans. A mixture of mint, lime, butter, and a handful of other ingredients are all it takes to make this recipe so tasty. From preparation to the plate, this recipe takes around 50 minutes. Overall, this recipe earns a great spoonacular score of 86%. If you like this recipe, take a look at these similar recipes: Roast salmon with peas, potatoes & bacon, Sweet Lime Pie With Salty Pretzel Crust, and Herb-roasted Salmon, Potatoes, Carrots, And Sugar Snap Peas.","How Sweet It Is Sweet Potato Lasagne is a main course that serves 6. For $4.4 per serving, this recipe covers 44% of your daily requirements of vitamins and minerals. One serving contains 501 calories, 25g of protein, and 24g of fat. This recipe from Foodista has 2 fans. This recipe is typical of Mediterranean cuisine. It is a good option if you're following a gluten free and lacto ovo vegetarian diet. If you have eggplants, jalapenos, basil leaves, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about 45 minutes. Overall, this recipe earns an amazing spoonacular score of 84%. Similar recipes are How Sweet It Is Sweet Potato Lasagne, Twice Baked Sweet Potato Potato Skins with Pecan Streusel (akan Individual Sweet Potato Casserole), and Twice Baked Sweet Potato Potato Skins with Pecan Streusel (akan Individual Sweet Potato Casserole).","If you have approximately 1 hour to spend in the kitchen, Loaded Paleo Nachos With Fresh Salsa & Guacamole might be an excellent gluten free, dairy free, paleolithic, and primal recipe to try. For $4.54 per serving, this recipe covers 49% of your daily requirements of vitamins and minerals. One portion of this dish contains about 30g of protein, 49g of fat, and a total of 874 calories. This recipe serves 4. 1 person were glad they tried this recipe. It works well as a hor d'oeuvre. It is brought to you by Foodista. It is a pretty expensive recipe for fans of Mexican food. A mixture of garlic cloves, cilantro, salt and pepper, and a handful of other ingredients are all it takes to make this recipe so tasty. With a spoonacular score of 81%, this dish is tremendous. Similar recipes are Nachos With Poblanos, Fresh Salsa, And Guacamole, Loaded Guacamole Nachos, and Rocco's Loaded Nachos With Turkey, Black Beans And Salsa.","Simple Roast Chicken is a gluten free recipe with 4 servings. For $2.76 per serving, this recipe covers 37% of your daily requirements of vitamins and minerals. One portion of this dish contains about 47g of protein, 64g of fat, and a total of 990 calories. It works well as a rather cheap main course. 2 people were glad they tried this recipe. From preparation to the plate, this recipe takes about 45 minutes. It is brought to you by Foodista. Head to the store and pick up chicken, butter, lemon, and a few other things to make it today. Overall, this recipe earns a solid spoonacular score of 69%. Try Simple Roast Chicken, The Best Simple Roast Chicken, and Simple Roast Chicken for similar recipes.","If you want to add more gluten free and dairy free recipes to your collection, Healthy Chicken Tortilla Soup with Chicken and Sweet Potato might be a recipe you should try. This recipe serves 4 and costs $2.3 per serving. One serving contains 343 calories, 22g of protein, and 13g of fat. It works well as a main course. This recipe from Foodista requires corn tortillas, ground cumin, kosher salt, and limes. 1 person were impressed by this recipe. It can be enjoyed any time, but it is especially good for Autumn. From preparation to the plate, this recipe takes around 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 87%. This score is excellent. Users who liked this recipe also liked Healthy Chicken Tortilla Soup, Healthy Chicken Tortilla Soup, and Healthy Chicken Tortilla Soup.","Wintery Vegetable Beef Soup is a main course that serves 8. Watching your figure? This gluten free recipe has 400 calories, 26g of protein, and 19g of fat per serving. For $1.88 per serving, this recipe covers 30% of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes around 45 minutes. This recipe is liked by 2 foodies and cooks. It will be a hit at your Autumn event. A mixture of butter, parsley, beef chuck, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is brought to you by Foodista. Overall, this recipe earns a good spoonacular score of 66%. If you like this recipe, take a look at these similar recipes: Wintery Vegetable Beef Soup, Beef Soup Series – Part 3: Hearty Beef Vegetable Soup, and Beef Soup Series – Part 3: Hearty Beef Vegetable Soup.","The recipe Spicy Vegan Chili can be made in about 45 minutes. Watching your figure? This gluten free, dairy free, lacto ovo vegetarian, and vegan recipe has 248 calories, 13g of protein, and 9g of fat per serving. For $1.75 per serving, you get a main course that serves 5. 1 person has tried and liked this recipe. It is a reasonably priced recipe for fans of American food. The Super Bowl will be even more special with this recipe. A mixture of onion, garlic cloves, salt, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 77%, which is solid. If you like this recipe, take a look at these similar recipes: Spicy 3-Bean Chili (Vegan), Hot & spicy vegan chili with lentil-walnut meat, and Hot & spicy vegan chili with lentil-walnut meat.","Venison Meatloaf with Blackberry BBQ Sauce and Buffalo Sweet Potato/Pumpkin Hash might be just the main course you are searching for. For $12.6 per serving, this recipe covers 37% of your daily requirements of vitamins and minerals. One portion of this dish contains about 40g of protein, 20g of fat, and a total of 614 calories. This recipe serves 6. Only a few people made this recipe, and 1 would say it hit the spot. It is brought to you by Foodista. Head to the store and pick up salt, egg, hickory bacon, and a few other things to make it today. From preparation to the plate, this recipe takes around 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 57%. This score is good. Cheddar-Stuffed Sweet Potato BBQ Turkey Meatloaf, Cheddar-Stuffed Sweet Potato BBQ Turkey Meatloaf, and Cheddar-Stuffed Sweet Potato BBQ Turkey Meatloaf are very similar to this recipe.","If you want to add more Latin American recipes to your recipe box, Ahi Tuna Ceviche might be a recipe you should try. One serving contains 117 calories, 16g of protein, and 4g of fat. For $2.29 per serving, you get a main course that serves 3. It is brought to you by Foodista. It is a good option if you're following a gluten free, dairy free, and pescatarian diet. Not a lot of people made this recipe, and 3 would say it hit the spot. A mixture of ahi tuna steak, sesame oil, serrano pepper, and a handful of other ingredients are all it takes to make this recipe so scrumptious. From preparation to the plate, this recipe takes roughly 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 63%. This score is good. Similar recipes include Margaritan Ahi Tuna Ceviche, Uncle Bill's Ahi Ahi Tuna, and Chili Crusted Ahi Tuna & Avocado Salad with Cilantro Garlic Dressing (GF!) … and Fave Five Friday: Healthy Tuna.","Need a gluten free and primal main course? Arugula Salad With Sweet Potato Croutons could be a tremendous recipe to try. For $1.33 per serving, this recipe covers 14% of your daily requirements of vitamins and minerals. One portion of this dish contains about 12g of protein, 25g of fat, and a total of 322 calories. This recipe serves 4. This recipe is liked by 1 foodies and cooks. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly 45 minutes. A mixture of sweet potato, olive oil, rosemary, and a handful of other ingredients are all it takes to make this recipe so flavorful. Taking all factors into account, this recipe earns a spoonacular score of 63%, which is good. If you like this recipe, you might also like recipes such as Sweet Potato Wild Rice and Arugula Salad, Grilled Peach Sweet Potato Arugula Salad, and Roasted Cauliflower Salad with Arugula & Sweet Potato.","Lamb & Sweet Potato Pot Pie might be just the main course you are searching for. For $2.96 per serving, this recipe covers 25% of your daily requirements of vitamins and minerals. One serving contains 961 calories, 21g of protein, and 64g of fat. This recipe serves 8. This recipe is liked by 4 foodies and cooks. Head to the store and pick up ice water, demi glace, flour, and a few other things to make it today. From preparation to the plate, this recipe takes roughly 45 minutes. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 59%, which is solid. Users who liked this recipe also liked Lamb and Sweet Potato Pie, Sweet Potato Pot Pie Recipe, and Chicken Pot Pie with Sweet Potato Biscuits.","Sweet Potato and Chicken Sausage Breakfast Skillet is a main course that serves 6. One portion of this dish contains about 20g of protein, 20g of fat, and a total of 364 calories. For $1.77 per serving, this recipe covers 21% of your daily requirements of vitamins and minerals. 1 person has made this recipe and would make it again. If you have pepper, bell peppers, garlic, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. From preparation to the plate, this recipe takes approximately 39 minutes. It is a good option if you're following a gluten free and primal diet. Taking all factors into account, this recipe earns a spoonacular score of 52%, which is pretty good. If you like this recipe, take a look at these similar recipes: Sweet Potato & Maple Sausage Breakfast Skillet, Chicken Sausage, Brussels Sprouts and Spiralized Sweet Potato Skillet, and Breakfast Potato Sausage and Egg Skillet.","Chicken/sweet Potato Roulade With Goat Cheese Sauce might be just the European recipe you are searching for. This gluten free and primal recipe serves 2 and costs $2.16 per serving. One portion of this dish contains around 20g of protein, 8g of fat, and a total of 231 calories. Head to the store and pick up baked sweet potato, chicken broth, ground pepper, and a few other things to make it today. This recipe from Foodista has 1 fans. It works well as a main course. From preparation to the plate, this recipe takes approximately 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 54%. This score is solid. Similar recipes are Goat Cheese and Herb Stuffed Chicken Roulade, Sweet Potato and Garlicky Swiss Chard Bucatini with Blood Orange Goat Cheese Sauce, and Quick Chicken Sweet Potato Kale Skillet with Cranberries and Goat Cheese.","Sweet Potato, Squash and Apple Soup is a hor d'oeuvre that serves 12. One portion of this dish contains roughly 6g of protein, 17g of fat, and a total of 294 calories. For 100 cents per serving, this recipe covers 14% of your daily requirements of vitamins and minerals. This recipe is liked by 1 foodies and cooks. From preparation to the plate, this recipe takes around 45 minutes. A mixture of onion, kabocha squash, sweet potatoes, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is a good option if you're following a gluten free, dairy free, paleolithic, and primal diet. It can be enjoyed any time, but it is especially good for Autumn. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 62%. This score is solid. Similar recipes are Butternut Squash Sweet Potato Apple Soup, Butternut Squash Sweet Potato Apple Soup, and Sweet Acorn Squash And Apple Soup.","The recipe Curry Mee Noodle Soup could satisfy your Indian craving in about 30 minutes. This main course has 461 calories, 20g of protein, and 23g of fat per serving. For $2.13 per serving, this recipe covers 19% of your daily requirements of vitamins and minerals. This recipe serves 6. 1 person has tried and liked this recipe. This recipe from Foodista requires vegetable oil, fish sauce, sugar, and paprika. Autumn will be even more special with this recipe. It is a good option if you're following a dairy free diet. Taking all factors into account, this recipe earns a spoonacular score of 0%, which is very bad (but still fixable). Try Penang Hokkien Mee (prawn Noodle / Har Meen / Mee Yoke / ????), Sponsored : Mee Istimewa (Noodle Soup), and Mee Udang (malay Prawn Noodle) for similar recipes.","Easy Chicken Tikka Masala might be a good recipe to expand your main course recipe box. One serving contains 371 calories, 38g of protein, and 20g of fat. This gluten free recipe serves 4 and costs $2.19 per serving. 54 people were glad they tried this recipe. If you have salt, water, onion, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about 45 minutes. This recipe is typical of Indian cuisine. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 84%. This score is excellent. If you like this recipe, take a look at these similar recipes: Easy Chicken Tikka Masala, Easy Chicken Tikka Masala, and Easy Chicken Tikka Masala.","If you want to add more gluten free, dairy free, and whole 30 recipes to your repertoire, Chai Pani’s Malabar Chicken Curry might be a recipe you should try. This recipe makes 4 servings with 544 calories, 53g of protein, and 26g of fat each. For $3.75 per serving, this recipe covers 41% of your daily requirements of vitamins and minerals. Not a lot of people really liked this Indian dish. 1 person found this recipe to be scrumptious and satisfying. It works well as a main course. If you have ginger, fenugreek seeds, cilantro, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. From preparation to the plate, this recipe takes around 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 81%. This score is super. Similar recipes include Chai Pani’s Malabar Chicken Curry, malabar spinach curry | mangalorean style malabar spinach curry, and Malabar Fish Curry.","The recipe Chicken Tikka Masalan Indian could satisfy your Indian craving in roughly 45 minutes. This main course has 877 calories, 65g of protein, and 29g of fat per serving. This recipe serves 4 and costs $5.13 per serving. A mixture of chicken breasts, paprika, yogurt, and a handful of other ingredients are all it takes to make this recipe so scrumptious. This recipe from Foodista has 1 fans. All things considered, we decided this recipe deserves a spoonacular score of 74%. This score is pretty good. Similar recipes are chicken tikka masala , how to make chicken tikka masala, chicken tikka masala , how to make chicken tikka masala, and chicken tikka masala , how to make chicken tikka masala.","You can never have too many main course recipes, so give Cashew Butter Chicken a try. One serving contains 431 calories, 46g of protein, and 24g of fat. This recipe serves 4. For $2.5 per serving, this recipe covers 25% of your daily requirements of vitamins and minerals. It is a budget friendly recipe for fans of Indian food. 1 person has made this recipe and would make it again. A mixture of garlic, oil, plum tomatoes, and a handful of other ingredients are all it takes to make this recipe so tasty. It is brought to you by Foodista. From preparation to the plate, this recipe takes around 30 minutes. It is a good option if you're following a gluten free diet. Overall, this recipe earns a solid spoonacular score of 65%. Asian Salad with Cashew Dressing and Cashew Butter Cookies, Cashew Butter Chicken, and Almond Crusted Chicken with Cashew Butter and Roasted Cranberries are very similar to this recipe.","Thai Basil Chicken With Green Curry might be just the main course you are searching for. This gluten free and dairy free recipe serves 4 and costs $2.5 per serving. One portion of this dish contains around 28g of protein, 34g of fat, and a total of 491 calories. Only a few people made this recipe, and 1 would say it hit the spot. A mixture of chicken stock, fish sauce, curry paste, and a handful of other ingredients are all it takes to make this recipe so scrumptious. From preparation to the plate, this recipe takes roughly 45 minutes. It is an affordable recipe for fans of Indian food. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 60%, which is good. Users who liked this recipe also liked Thai Basil Chicken With Green Curry, Thai Basil Chicken With Green Curry, and Homemade Thai Green Curry Paste (And An Easy Thai Green Curry).","Hyderabadi Chicken Curry might be just the main course you are searching for. This recipe makes 3 servings with 528 calories, 39g of protein, and 35g of fat each. For $3.72 per serving, this recipe covers 27% of your daily requirements of vitamins and minerals. Head to the store and pick up ginger paste, garlic paste, turmeric powder, and a few other things to make it today. 1 person has made this recipe and would make it again. This recipe is typical of Indian cuisine. It is a good option if you're following a gluten free and ketogenic diet. From preparation to the plate, this recipe takes roughly 45 minutes. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 57%, which is solid. If you like this recipe, take a look at these similar recipes: hyderabadi chicken biryani , how to make chicken biryani, hyderabadi chicken biryani , how to make chicken biryani, and andhra chicken curry – kodi kura with gravy (simple chicken curry ).","Need a gluten free, dairy free, whole 30, and ketogenic main course? Curry Chicken Salad could be an amazing recipe to try. This recipe serves 2 and costs $3.23 per serving. One serving contains 683 calories, 35g of protein, and 53g of fat. Head to the store and pick up salad greens, carrot, turmeric powder, and a few other things to make it today. From preparation to the plate, this recipe takes roughly 25 minutes. It is a pretty expensive recipe for fans of Indian food. This recipe is liked by 1 foodies and cooks. It is brought to you by Foodista. Overall, this recipe earns a good spoonacular score of 60%. Users who liked this recipe also liked Curry Chicken Salad, Curry Chicken Salad, and Curry Chicken Salad.","Curry and Sage Roast Chicken could be just the gluten free, dairy free, paleolithic, and primal recipe you've been looking for. This recipe serves 4. This main course has 565 calories, 36g of protein, and 39g of fat per serving. For $1.98 per serving, this recipe covers 21% of your daily requirements of vitamins and minerals. Not a lot of people made this recipe, and 2 would say it hit the spot. This recipe from Foodista requires turmeric, juice of lemon, pepper, and olive oil. This recipe is typical of Indian cuisine. From preparation to the plate, this recipe takes about 1 hour. Taking all factors into account, this recipe earns a spoonacular score of 55%, which is pretty good. Users who liked this recipe also liked Curry and Sage Roast Chicken, Parmesan-Sage Roast Turkey with Sage Gravy, and Sage Pesto-Rubbed Roast Chicken.","Easy Chicken Tandoori is an Indian recipe that serves 12. One serving contains 236 calories, 17g of protein, and 9g of fat. For $2.3 per serving, this recipe covers 18% of your daily requirements of vitamins and minerals. Only a few people made this recipe, and 7 would say it hit the spot. It is a good option if you're following a gluten free diet. It works best as a main course, and is done in roughly 45 minutes. This recipe from Foodista requires chicken, tikka tandoori paste, onions, and tomatoes. Overall, this recipe earns a solid spoonacular score of 58%. Users who liked this recipe also liked Easy Chicken Tandoori, Aarti's Easy Tandoori Chicken, and Easy Homemade Tandoori Chicken.","The recipe Cauliflower, Brown Rice, and Vegetable Fried Rice is ready in around 30 minutes and is definitely a great gluten free, dairy free, lacto ovo vegetarian, and vegan option for lovers of Chinese food. This recipe makes 8 servings with 248 calories, 7g of protein, and 13g of fat each. For $1.19 per serving, this recipe covers 19% of your daily requirements of vitamins and minerals. It works well as a hor d'oeuvre. 3689 people have made this recipe and would make it again. It is brought to you by fullbellysisters.blogspot.com. Head to the store and pick up broccoli, t grapeseed oil, sesame seeds, and a few other things to make it today. With a spoonacular score of 100%, this dish is amazing. Cauliflower, Brown Rice, and Vegetable Fried Rice, Cauliflower, Brown Rice, and Vegetable Fried Rice, and Cauliflower, Brown Rice, and Vegetable Fried Rice are very similar to this recipe.","Vietnamese Pancakes with Vegetables, Herbs and a Fragrant Dipping Sauce (Bánh Xèo) requires roughly 45 minutes from start to finish. One serving contains 390 calories, 8g of protein, and 22g of fat. This gluten free, dairy free, and lacto ovo vegetarian recipe serves 6 and costs $3.19 per serving. Head to the store and pick up chilies, rice vinegar, enoki mushrooms, and a few other things to make it today. 295 people found this recipe to be yummy and satisfying. It works well as a side dish. Plenty of people really liked this Vietnamese dish. It is brought to you by foodandspice.blogspot.com. Overall, this recipe earns an awesome spoonacular score of 94%. Similar recipes include Bánh xèo (Vietnamese Happy Pancakes), Banh Xeo (Bánh Xèo) – Savory Vietnamese Crêpe, and Banh Xeo (Vietnamese Crepes).","Baby Bok Choy Stir Fry is a hor d'oeuvre that serves 2. One portion of this dish contains about 6g of protein, 9g of fat, and a total of 139 calories. For $1.09 per serving, this recipe covers 24% of your daily requirements of vitamins and minerals. This recipe is liked by 3 foodies and cooks. This recipe from Foodista requires salt, almonds, garlic, and pepper flakes. It is a good option if you're following a gluten free, dairy free, paleolithic, and lacto ovo vegetarian diet. From preparation to the plate, this recipe takes around 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 94%, which is amazing. If you like this recipe, you might also like recipes such as Baby Bok Choy Stir Fry, Baby Bok Choy Stir Fry, and Beef Stir-Fry with Baby Bok Choy.","Mung Bean Sprout and Quinoa Salad is a gluten free, dairy free, lacto ovo vegetarian, and vegan recipe with 6 servings. For $1.49 per serving, this recipe covers 31% of your daily requirements of vitamins and minerals. One portion of this dish contains about 17g of protein, 11g of fat, and a total of 356 calories. 1 person found this recipe to be yummy and satisfying. Head to the store and pick up of oregano, cilantro, tomatoes, and a few other things to make it today. It works well as an affordable main course. It is brought to you by Foodista. From preparation to the plate, this recipe takes about 45 minutes. Overall, this recipe earns an awesome spoonacular score of 92%. Try Mung Bean Sprout Salad, Korean Mung Bean Sprout Salad, and Mung beans, Beets and Quinoa Salad for similar recipes.","If you have about 35 minutes to spend in the kitchen, Pesto Zucchini Pasta (Whole 30 Approved) might be a super gluten free, dairy free, paleolithic, and lacto ovo vegetarian recipe to try. For $2.38 per serving, you get a hor d'oeuvre that serves 4. One portion of this dish contains about 5g of protein, 16g of fat, and a total of 189 calories. 1 person has made this recipe and would make it again. Head to the store and pick up salt, tomato, pine nuts, and a few other things to make it today. It is brought to you by Foodista. Overall, this recipe earns an outstanding spoonacular score of 82%. Similar recipes include Zucchini “Pasta” with Pesto Sauce, Air Fryer Potatoes with Homemade Pesto – Vegan and Whole 30 Approved, and Basil Pesto Pasta with Zucchini and Mint.","Vegetable Coconut Sambar might be just the main course you are searching for. One portion of this dish contains roughly 19g of protein, 19g of fat, and a total of 447 calories. This recipe serves 4. For $2.47 per serving, this recipe covers 35% of your daily requirements of vitamins and minerals. It is a good option if you're following a gluten free and dairy free diet. If you have cumin seeds, brown mustard seeds, sea salt, and a few other ingredients on hand, you can make it. To use up the potato you could follow this main course with the Sweet Potato Pie as a dessert. A few people made this recipe, and 58 would say it hit the spot. It is brought to you by foodandspice.blogspot.com. From preparation to the plate, this recipe takes around 45 minutes. Overall, this recipe earns an excellent spoonacular score of 95%. If you like this recipe, you might also like recipes such as Sambar – How to make Vegetable Sambar | Quick Sambar, Vegetable Coconut Sambar, and Menthi Kura Sambar - Vendhaya Keerai Sambar - Methi Leaves Sambar.","Cauliflower Wings Revisited is a gluten free and vegan hor d'oeuvre. One serving contains 480 calories, 21g of protein, and 16g of fat. This recipe serves 2. For $2.65 per serving, this recipe covers 31% of your daily requirements of vitamins and minerals. 1 person were impressed by this recipe. If you have curry powder, cauliflower, nutritional yeast, and a few other ingredients on hand, you can make it. To use up the chickpea flour you could follow this main course with the Chickpea Flour Chocolate Chip Cookies as a dessert. It is brought to you by evolvevegan.blogspot.com. From preparation to the plate, this recipe takes around 30 minutes. With a spoonacular score of 2%, this dish is improvable. Cauliflower Wings Revisited, Cauliflower Buffalo Wings, and Skinny Cauliflower Wings are very similar to this recipe.","Trinidad Callaloo Soup is a Central American main course. One portion of this dish contains approximately 19g of protein, 42g of fat, and a total of 583 calories. For $3.25 per serving, this recipe covers 35% of your daily requirements of vitamins and minerals. This recipe serves 4. 1 person were glad they tried this recipe. It is a good option if you're following a gluten free and dairy free diet. It can be enjoyed any time, but it is especially good for Autumn. From preparation to the plate, this recipe takes about 45 minutes. It is brought to you by Foodista. Head to the store and pick up onion, okra, crab meat, and a few other things to make it today. Taking all factors into account, this recipe earns a spoonacular score of 80%, which is great. Similar recipes are Trinidad Callaloo Soup, Callaloo, and Trini Callaloo.","Amazing Chicken Pot Pie might be a good recipe to expand your main course collection. This recipe serves 6. For $2.29 per serving, this recipe covers 30% of your daily requirements of vitamins and minerals. One serving contains 534 calories, 42g of protein, and 25g of fat. If you have peas and carrots, onion, flour, and a few other ingredients on hand, you can make it. 1 person has made this recipe and would make it again. It is brought to you by Pink When. From preparation to the plate, this recipe takes approximately 50 minutes. Overall, this recipe earns a solid spoonacular score of 68%. Users who liked this recipe also liked Angela's Amazing Chicken Pot Pie, Healthy Chicken Pot Pie Soup in the crock pot (whole 30, dairy free), and Creamy Chicken and Mushroom One-Pot with Pot Pie Toppers.","Easy Chicken Pot Pie is a dairy free hor d'oeuvre. For 58 cents per serving, this recipe covers 10% of your daily requirements of vitamins and minerals. This recipe serves 6. One serving contains 177 calories, 5g of protein, and 6g of fat. This recipe is liked by 1 foodies and cooks. From preparation to the plate, this recipe takes roughly 45 minutes. This recipe from Foodista requires boned chicken, vegetables, cream of chicken, and bisquick. Taking all factors into account, this recipe earns a spoonacular score of 56%, which is solid. If you like this recipe, you might also like recipes such as Easy Chicken Pot Pie, Easy Chicken Pot Pie, and Easy Chicken Pot Pie.","If you want to add more dairy free recipes to your repertoire, Crock Pot Chicken Pot Pie might be a recipe you should try. This recipe serves 20 and costs 83 cents per serving. This hor d'oeuvre has 276 calories, 9g of protein, and 13g of fat per serving. 15 people were glad they tried this recipe. This recipe from Foodista requires egg white, condensed cream of chicken soup, pie crusts, and vegetables - we prefer peas and carrots. From preparation to the plate, this recipe takes approximately 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 59%. This score is solid. Users who liked this recipe also liked Healthy Chicken Pot Pie Soup in the crock pot (whole 30, dairy free), Crock Pot Chicken Pot Pie, and Crock Pot Chicken Pot Pie.","Swiss Chard Wraps is a gluten free, dairy free, paleolithic, and lacto ovo vegetarian recipe with 6 servings. One serving contains 137 calories, 4g of protein, and 11g of fat. For 82 cents per serving, this recipe covers 18% of your daily requirements of vitamins and minerals. It works best as a side dish, and is done in about 45 minutes. 14 people were impressed by this recipe. If you have swiss chard leaves, orange cauliflower, olive oil, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. Overall, this recipe earns an excellent spoonacular score of 96%. Swiss Chard Wraps, Sweet Thai Chile Chicken Swiss Chard Wraps with Peanut Ginger Sauce, and Swiss Chard are very similar to this recipe.","Peanut Butter and Jelly Smoothie might be a good recipe to expand your breakfast repertoire. Watching your figure? This gluten free, dairy free, and fodmap friendly recipe has 779 calories, 20g of protein, and 36g of fat per serving. For $1.45 per serving, this recipe covers 26% of your daily requirements of vitamins and minerals. This recipe serves 2. 58 people were impressed by this recipe. This recipe from Foodista requires almond milk, bananas, peanut butter, and strawberries. From preparation to the plate, this recipe takes roughly 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 95%, which is super. Try Peanut Butter and Jelly Smoothie, Peanut Butter and Jelly Smoothie, and Peanut Butter and Jelly Smoothie for similar recipes.","Peanut Butter And Chocolate Oatmeal is a Southern recipe that serves 1. Watching your figure? This gluten free and lacto ovo vegetarian recipe has 466 calories, 19g of protein, and 14g of fat per serving. For 67 cents per serving, this recipe covers 24% of your daily requirements of vitamins and minerals. It is brought to you by Foodista. 2 people have made this recipe and would make it again. Head to the store and pick up cooking oats, crunchy peanut butter, agave, and a few other things to make it today. It works best as a breakfast, and is done in about 45 minutes. Overall, this recipe earns a spectacular spoonacular score of 89%. If you like this recipe, take a look at these similar recipes: Browned Butter Peanut Butter Oatmeal Chocolate Chip Cookies, Chocolate Peanut Butter Oatmeal, and Chocolate and Peanut Butter Oatmeal.","The recipe Sweet-N-Smoky Salmon With Ginger Mahogany Rice can be made in around 45 minutes. Watching your figure? This gluten free, dairy free, fodmap friendly, and pescatarian recipe has 732 calories, 41g of protein, and 19g of fat per serving. For $4.78 per serving, this recipe covers 31% of your daily requirements of vitamins and minerals. This recipe serves 4. 52 people have made this recipe and would make it again. It works well as a main course. This recipe from Foodista requires brown sugar, chicken stock, mahogany rice, and liquid smoke. With a spoonacular score of 93%, this dish is awesome. If you like this recipe, take a look at these similar recipes: Sweet-n-smoky Salmon With Ginger Mahogany Rice, Mahogany Broiled Chicken with Smoky Lime Sweet Potatoes and Cilantro Chimichurri, and Sweet & Smoky Salmon Kabobs.","The recipe Skinny Green Monster Smoothie can be made in approximately 45 minutes. This recipe serves 1 and costs $1.99 per serving. This breakfast has 286 calories, 18g of protein, and 11g of fat per serving. 7 people have tried and liked this recipe. It is a good option if you're following a gluten free diet. If you have greek yogurt, baby spinach, peanut butter, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. It is perfect for Halloween. Taking all factors into account, this recipe earns a spoonacular score of 87%, which is great. Similar recipes include Skinny Green Monster Smoothie, Skinny Green Monster Smoothie, and Skinny Green Monster Smoothie.","Forget going out to eat or ordering takeout every time you crave African food. Try making African Bean Soup at home. For 43 cents per serving, you get a hor d'oeuvre that serves 4. One serving contains 189 calories, 10g of protein, and 5g of fat. 1 person were glad they tried this recipe. It will be a hit at your Autumn event. It is brought to you by Foodista. A mixture of water, carrots, peanut butter, and a handful of other ingredients are all it takes to make this recipe so yummy. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. From preparation to the plate, this recipe takes approximately 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 88%, which is outstanding. If you like this recipe, you might also like recipes such as African Pumpkin and Bean Soup, African Pumpkin and Bean Soup, and African Pumpkin and Bean Soup.","Banana Chocolate Pudding requires approximately 45 minutes from start to finish. Watching your figure? This gluten free, dairy free, lacto ovo vegetarian, and vegan recipe has 526 calories, 15g of protein, and 34g of fat per serving. For $1.02 per serving, this recipe covers 24% of your daily requirements of vitamins and minerals. This recipe serves 3. This recipe from Foodista has 1 fans. Head to the store and pick up avocado, bananas, cocoa powder, and a few other things to make it today. All things considered, we decided this recipe deserves a spoonacular score of 88%. This score is awesome. Similar recipes are Chocolate Banana Pudding, Chocolate-Banana Pudding, and Chocolate Banana Pudding.","The recipe Chinese Chicken Salad With Chipotle Dressing is ready in roughly 45 minutes and is definitely a tremendous gluten free and dairy free option for lovers of Chinese food. For $3.9 per serving, this recipe covers 39% of your daily requirements of vitamins and minerals. This main course has 780 calories, 51g of protein, and 46g of fat per serving. This recipe serves 4. 7 people were impressed by this recipe. Head to the store and pick up romaine lettuce, carrots, mint leaves, and a few other things to make it today. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 86%. This score is spectacular. If you like this recipe, you might also like recipes such as Chinese Chicken Salad with Sesame Dressing, Chinese Chicken Salad with Sesame Dressing, and Dom's Chinese Chicken Salad Dressing.","Noodles and Veggies With Peanut Sauce takes roughly 30 minutes from beginning to end. Watching your figure? This dairy free, lacto ovo vegetarian, and vegan recipe has 686 calories, 21g of protein, and 25g of fat per serving. For $1.06 per serving, this recipe covers 25% of your daily requirements of vitamins and minerals. This recipe serves 4. 1 person has tried and liked this recipe. It works well as a budget friendly main course. It is brought to you by Foodista. A mixture of snowpeas, garlic cloves, distilled vinegar, and a handful of other ingredients are all it takes to make this recipe so yummy. All things considered, we decided this recipe deserves a spoonacular score of 88%. This score is excellent. If you like this recipe, take a look at these similar recipes: Spicy Peanut Sauce with Brown Rice Noodles and Veggies, One-Pot Peanut Sesame Noodles & Veggies, and Rice Noodles With Tahini Sauce and Mixed Veggies.","The recipe Curry Beef Over Rice Noodles can be made in approximately 45 minutes. This main course has 659 calories, 61g of protein, and 20g of fat per serving. This dairy free recipe serves 2 and costs $2.8 per serving. 1 person has made this recipe and would make it again. It is brought to you by Foodista. If you have natural roasted peanuts, soy sauce, garlic, and a few other ingredients on hand, you can make it. Not a lot of people really liked this Indian dish. All things considered, we decided this recipe deserves a spoonacular score of 86%. This score is awesome. Similar recipes include Burmese Beef Curry with Vermicelli Rice Noodles, Crockpot Beef Curry with Noodles, and Crockpot Beef Curry with Noodles.","Soy Ginger Glazed Halibut with Ginger Peach Relish requires about 45 minutes from start to finish. Watching your figure? This gluten free, dairy free, and pescatarian recipe has 382 calories, 49g of protein, and 10g of fat per serving. For $9.02 per serving, this recipe covers 31% of your daily requirements of vitamins and minerals. This recipe serves 2. If you have olive oil, ginger, halibut fillets, and a few other ingredients on hand, you can make it. It works well as a main course. 58 people have tried and liked this recipe. It is brought to you by Foodista. Overall, this recipe earns an excellent spoonacular score of 93%. Halibut with Soy-Ginger Dressing, Halibut with Pineapple Soy Ginger Sauce + a Le Creuset Giveaway, and Ginger Soy Glazed Salmon are very similar to this recipe.","Spice-Rubbed Lemon Barbecue Salmon is a Barbecue main course. This recipe serves 2. One serving contains 337 calories, 36g of protein, and 12g of fat. For $4.55 per serving, this recipe covers 37% of your daily requirements of vitamins and minerals. Father's Day will be even more special with this recipe. Head to the store and pick up honey, sea salt, lemon, and a few other things to make it today. This recipe from Foodista has 1 fans. From preparation to the plate, this recipe takes roughly 45 minutes. It is a good option if you're following a gluten free, dairy free, and pescatarian diet. With a spoonacular score of 92%, this dish is super. Similar recipes are Spice-Rubbed Pork Tenderloin with Mustard Barbecue Sauce, Spice-rubbed Salmon, and Spice Rubbed Salmon.","Fetan Encrusted Salmon takes about 25 minutes from beginning to end. For $5.06 per serving, this recipe covers 36% of your daily requirements of vitamins and minerals. One serving contains 388 calories, 44g of protein, and 15g of fat. This recipe serves 4. This recipe from Foodista requires dill, salmon fillets, sea salt, and olive oil. 1 person found this recipe to be yummy and satisfying. It works well as a main course. It is a good option if you're following a pescatarian diet. With a spoonacular score of 92%, this dish is excellent. If you like this recipe, you might also like recipes such as Almond Encrusted Salmon, Thyme Encrusted Salmon with Blackberry Gastrique, and Sweet and Spicy Dijon Encrusted Salmon.","If you want to add more gluten free, dairy free, and pescatarian recipes to your collection, Sockeye Salmon on Kiwi & Lemon Puree might be a recipe you should try. One serving contains 433 calories, 46g of protein, and 22g of fat. This recipe serves 4. For $5.62 per serving, this recipe covers 36% of your daily requirements of vitamins and minerals. It works best as a main course, and is done in about 45 minutes. If you have lemon zest, scallion, lemonade, and a few other ingredients on hand, you can make it. This recipe is liked by 1 foodies and cooks. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 92%, which is amazing. Similar recipes are Salmon on Kiwi & Lemon Puree, Lemon Herb Baked Sockeye Salmon Recipe, and Lemon Garlic Baked Sockeye Salmon with Asparagus.","Salmon Confit with Lemongrass Sauce is a main course that serves 2. Watching your figure? This gluten free, pescatarian, and ketogenic recipe has 865 calories, 46g of protein, and 68g of fat per serving. For $8.86 per serving, this recipe covers 55% of your daily requirements of vitamins and minerals. 4 people were impressed by this recipe. This recipe from Foodista requires garlic, lemon juice, liquid chicken stock, and salt and pepper. From preparation to the plate, this recipe takes roughly 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 90%, which is amazing. If you like this recipe, you might also like recipes such as Salmon Confit with Lemongrass Sauce, Salmon Confit with Lemongrass Sauce, and Poached Salmon with Artichoke Confit.","If you want to add more gluten free, dairy free, paleolithic, and primal recipes to your recipe box, Grilled Salmon With Cherry, Pineapple, Mango Salsa might be a recipe you should try. For $9.68 per serving, this recipe covers 40% of your daily requirements of vitamins and minerals. This recipe makes 2 servings with 537 calories, 37g of protein, and 19g of fat each. It works well as an expensive main course for The Fourth Of July. From preparation to the plate, this recipe takes about 15 minutes. It is brought to you by Foodista. Only a few people made this recipe, and 1 would say it hit the spot. A mixture of salt and pepper, lime zest, salmon fillet, and a handful of other ingredients are all it takes to make this recipe so flavorful. This recipe is typical of Mexican cuisine. All things considered, we decided this recipe deserves a spoonacular score of 91%. This score is amazing. Similar recipes are Grilled Salmon With Cherry, Pineapple, Mango Salsa, Grilled Salmon With Cherry, Pineapple, Mango Salsa, and Grilled Salmon With Cherry, Pineapple, Mango Salsa.","Roasted Alaskan Salmon with Cherries is a gluten free, dairy free, paleolithic, and primal recipe with 4 servings. For $3.64 per serving, this recipe covers 19% of your daily requirements of vitamins and minerals. One portion of this dish contains approximately 24g of protein, 7g of fat, and a total of 253 calories. Only a few people really liked this main course. This recipe from Foodista requires cherries, thyme, honey, and lemon juice. 1 person found this recipe to be delicious and satisfying. From preparation to the plate, this recipe takes approximately 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 78%. This score is solid. Similar recipes include Alaskan Salmon Chowder, Barbecued Alaskan Salmon, and Alaskan Amber Salmon Marinade.","You can never have too many hor d'oeuvre recipes, so give Watermelon Leaf Lettuce Salad With Light Fetan a try. Watching your figure? This gluten free recipe has 248 calories, 5g of protein, and 18g of fat per serving. This recipe serves 3 and costs $2.48 per serving. 1 person were glad they tried this recipe. It will be a hit at your Summer event. A mixture of watermelon, balsamic vinaigrette, salt and pepper, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly 45 minutes. Overall, this recipe earns a solid spoonacular score of 74%. Users who liked this recipe also liked Watermelon Leaf Lettuce Salad With Light Feta, Watermelon Leaf Lettuce Salad With Light Feta, and Baby Leaf Lettuce with Olives and Watermelon.","The recipe Fresh Cherry Scones can be made in about 45 minutes. This gluten free and lacto ovo vegetarian recipe serves 8 and costs 91 cents per serving. This breakfast has 336 calories, 9g of protein, and 10g of fat per serving. If you have applesauce, oat flour, walnuts, and a few other ingredients on hand, you can make it. 1 person found this recipe to be yummy and satisfying. It is brought to you by Foodista. It is a very budget friendly recipe for fans of European food. All things considered, we decided this recipe deserves a spoonacular score of 66%. This score is good. Try Fresh Cherry Scones, 10 Pound Cherry Challenge: White Chocolate Cherry Scones, and Bittersweet Chocolate-Cherry Sorbet with Fresh Cherry Compote for similar recipes.","Cherry Coconut Milk Smoothie is a gluten free, dairy free, paleolithic, and lacto ovo vegetarian recipe with 2 servings. One portion of this dish contains approximately 4g of protein, 17g of fat, and a total of 305 calories. For $2.04 per serving, this recipe covers 14% of your daily requirements of vitamins and minerals. Head to the store and pick up hemp milk, vanilla, coconut milk, and a few other things to make it today. Several people really liked this breakfast. This recipe is liked by 130 foodies and cooks. From preparation to the plate, this recipe takes about 45 minutes. It is brought to you by foodandspice.blogspot.com. All things considered, we decided this recipe deserves a spoonacular score of 68%. This score is solid. Cherry Coconut Milk Smoothie, Cherry Coconut Milk Smoothie, and Coconut Milk Smoothie are very similar to this recipe.","Gnocchi and Wilted Spinach Salad could be just the dairy free recipe you've been looking for. This main course has 578 calories, 15g of protein, and 30g of fat per serving. This recipe serves 4 and costs $3.11 per serving. 2 people were impressed by this recipe. This recipe from Foodista requires juice of lemon, baby spinach leaves, honey, and shallots. This recipe is typical of Mediterranean cuisine. From preparation to the plate, this recipe takes about 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 60%. This score is solid. Similar recipes are Gnocchi and Wilted Spinach Salad, Gnocchi and Wilted Spinach Salad, and Gnocchi and Wilted Spinach Salad.","Vanilla Bean Cherry Granola Bars takes roughly 45 minutes from beginning to end. This breakfast has 474 calories, 12g of protein, and 23g of fat per serving. This recipe serves 8. For $1.98 per serving, this recipe covers 20% of your daily requirements of vitamins and minerals. This recipe from Foodista requires un-sweetened apple sauce, flax seeds, semi-sweet chocolate chips, and vanilla bean. 1 person were impressed by this recipe. It is a good option if you're following a gluten free and dairy free diet. Overall, this recipe earns a pretty good spoonacular score of 58%. Try Vanilla Bean Cherry Granola Bars, Whole Wheat Cherry Vanilla Bean Pancakes With Vanilla Bean Glaze, and Cherry Vanilla Granola for similar recipes.","Raspberry & Granola Parfait is a lacto ovo vegetarian recipe with 1 servings. One serving contains 407 calories, 25g of protein, and 7g of fat. For $3.03 per serving, this recipe covers 18% of your daily requirements of vitamins and minerals. 1 person were glad they tried this recipe. Head to the store and pick up cherry preserves, granola, raspberries, and a few other things to make it today. From preparation to the plate, this recipe takes around 5 minutes. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 61%, which is solid. If you like this recipe, take a look at these similar recipes: Raspberry & Granola Parfait, Raspberry Pretzel Granola Parfait, and Fruit And Yogurt Parfait Recipe (grapes And Granola Parfait).","The recipe Fruit Falooda - How to make Mixed Fruit - Falooda Varieties can be made in approximately 20 minutes. This side dish has 353 calories, 7g of protein, and 11g of fat per serving. This recipe serves 4. For $1.57 per serving, this recipe covers 15% of your daily requirements of vitamins and minerals. Head to the store and pick up fruits, rose syrup / rooh afza, falooda seeds / sabja / basil / tukmaria seeds, and a few other things to make it today. 1 person has tried and liked this recipe. It is brought to you by thecuisine.blogspot.com. Overall, this recipe earns a very bad (but still fixable) spoonacular score of 0%. If you like this recipe, you might also like recipes such as falooda , how to make falooda with ice cream, Falooda | How to make faloodan at home, and Falooda | How to make faloodan at home.","Need a gluten free and lacto ovo vegetarian hor d'oeuvre? Strawberry-Mango Quinoa Salad could be an awesome recipe to try. This recipe serves 4. One serving contains 354 calories, 8g of protein, and 17g of fat. For $1.87 per serving, this recipe covers 21% of your daily requirements of vitamins and minerals. 41 person were impressed by this recipe. This recipe from Foodista requires cucumber, cream, mango, and strawberries. From preparation to the plate, this recipe takes about 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 97%. This score is tremendous. Similar recipes are Strawberry-Mango Quinoa Salad, Strawberry-Mango Quinoa Salad, and Strawberry & Mango Chopped Spinach Quinoa Salad with Sesame-Lime Vinaigrette.","Amaranth and Roast Veggie Salad could be just the gluten free, dairy free, lacto ovo vegetarian, and vegan recipe you've been looking for. This recipe serves 2 and costs $2.47 per serving. This hor d'oeuvre has 361 calories, 9g of protein, and 18g of fat per serving. From preparation to the plate, this recipe takes roughly 45 minutes. This recipe from Foodista requires amaranth, punnet baby tomatoes, bell pepper, and pumpkin. 5 people have tried and liked this recipe. Overall, this recipe earns an outstanding spoonacular score of 95%. If you like this recipe, take a look at these similar recipes: Mum’s Roast Veggie Salad, amaranth yogurt parfait – popped amaranth parfait with fruits, and amaranth yogurt parfait – popped amaranth parfait with fruits.","If you want to add more gluten free, dairy free, paleolithic, and lacto ovo vegetarian recipes to your repertoire, Carrot and Cabbage Salad With Coriander+cumin Dry Rub might be a recipe you should try. This recipe serves 1. One portion of this dish contains about 6g of protein, 10g of fat, and a total of 222 calories. For $1.4 per serving, this recipe covers 27% of your daily requirements of vitamins and minerals. 4 people have made this recipe and would make it again. Head to the store and pick up sunflower seeds, cumin seed powder, juice of lime, and a few other things to make it today. It works well as an affordable hor d'oeuvre. From preparation to the plate, this recipe takes roughly 25 minutes. It is brought to you by Foodista. Overall, this recipe earns a super spoonacular score of 96%. If you like this recipe, you might also like recipes such as Carrot and Cabbage Salad With Coriander+cumin Dry Rub, Carrot and Cabbage Salad With Coriander+cumin Dry Rub, and Carrot and Cabbage Salad With Coriander+cumin Dry Rub.","Radish & Snap Pea Quinoa Salad is a gluten free and lacto ovo vegetarian hor d'oeuvre. For $1.68 per serving, this recipe covers 23% of your daily requirements of vitamins and minerals. One serving contains 262 calories, 11g of protein, and 7g of fat. This recipe serves 4. If you have juice of lemon, flat leaf parsley, snap peas, and a few other ingredients on hand, you can make it. 2 people have tried and liked this recipe. It is brought to you by Foodista. From preparation to the plate, this recipe takes around 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 92%, which is spectacular. If you like this recipe, you might also like recipes such as Sugar Snap Pean And Radish Salad, Radish And Sugar Snap Pea Salad, and Snap Pea Salad With Radish & Lime.","Quinoa, Tomato, Green Onion Side Salad might be a good recipe to expand your hor d'oeuvre recipe box. For $1.39 per serving, this recipe covers 23% of your daily requirements of vitamins and minerals. One portion of this dish contains about 11g of protein, 18g of fat, and a total of 396 calories. This recipe serves 2. This recipe from Foodista has 2 fans. Head to the store and pick up green onions, water, salt and pepper, and a few other things to make it today. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. From preparation to the plate, this recipe takes approximately 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 93%. This score is amazing. Users who liked this recipe also liked Cucumber Tomato and Green Onion Salad, Fetan and Green Onion Couscous Cakes over Tomato-Olive Salad, and Onion Tomato Gotsu or Thakkali Kosthu | Side Dish For Idli Dosa.","Butternut Squash Tofu Salad With Toasted Hazelnuts takes roughly 45 minutes from beginning to end. For $1.55 per serving, you get a main course that serves 4. One serving contains 261 calories, 13g of protein, and 11g of fat. 1 person has made this recipe and would make it again. Head to the store and pick up onions, lemon juice, bell pepper, and a few other things to make it today. It is brought to you by Foodista. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. Taking all factors into account, this recipe earns a spoonacular score of 93%, which is amazing. Butternut Squash Noodles with Toasted Hazelnuts and Crispy Sage, Butternut Squash Salad with Hazelnuts, and Butternut Squash Salad With Pomegranates And Toasted Pumpkin Seeds are very similar to this recipe.","Egyptain Cauliflower Side Salad could be just the gluten free, dairy free, paleolithic, and lacto ovo vegetarian recipe you've been looking for. This recipe makes 2 servings with 183 calories, 4g of protein, and 15g of fat each. For $1.51 per serving, this recipe covers 18% of your daily requirements of vitamins and minerals. This recipe is liked by 3 foodies and cooks. It works well as a hor d'oeuvre. A mixture of cauliflower, cumin, parsley, and a handful of other ingredients are all it takes to make this recipe so yummy. It is brought to you by Foodista. From preparation to the plate, this recipe takes approximately 25 minutes. All things considered, we decided this recipe deserves a spoonacular score of 93%. This score is excellent. Similar recipes include Roasted Broccoli and Cauliflower: Simple for the Side, Sauteed Beef with Broccoli and Shiitake Mushrooms (and a side of my new fave: cauliflower rice), and Black Bean and Corn Salad - Spicy Mexican Salad/Side Dish.","Okra Tomato Salad might be a good recipe to expand your hor d'oeuvre recipe box. For $1.66 per serving, this recipe covers 18% of your daily requirements of vitamins and minerals. Watching your figure? This gluten free, dairy free, paleolithic, and lacto ovo vegetarian recipe has 101 calories, 4g of protein, and 1g of fat per serving. This recipe serves 1. This recipe from Foodista requires two-inch long okra pods, tomato, balsamic vinegar, and basil. 1 person found this recipe to be flavorful and satisfying. From preparation to the plate, this recipe takes about 45 minutes. With a spoonacular score of 92%, this dish is super. Okra Tomato Salad, Grilled Sausage Okran and Tomato Salad, and Fried Green Tomato Salad With Roasted Corn, Okran And Tomatoes are very similar to this recipe.","Need a gluten free, dairy free, lacto ovo vegetarian, and vegan hor d'oeuvre? Summer Kale, Orange & Pomegranate Salad with Moscato Dressing could be a super recipe to try. This recipe serves 4 and costs $1.52 per serving. One serving contains 165 calories, 4g of protein, and 10g of fat. 1 person were impressed by this recipe. The Fourth Of July will be even more special with this recipe. This recipe from Foodista requires bell pepper, cabbage, extra virgin olive oil, and sunflower seeds. From preparation to the plate, this recipe takes roughly 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 87%, which is awesome. Users who liked this recipe also liked Persimmon Kale Salad with Pomegranate Dressing, Kale, Pomegranate & Mandarin Orange Salad, and Kale Salad with Pomegranate, Orange and Pine Nuts.","If you want to add more gluten free, dairy free, paleolithic, and lacto ovo vegetarian recipes to your repertoire, fennel, Peppers, Lettuce Salad might be a recipe you should try. This recipe makes 1 servings with 566 calories, 24g of protein, and 24g of fat each. For $9.0 per serving, this recipe covers 60% of your daily requirements of vitamins and minerals. Head to the store and pick up olive oil, rosemary, pickled cucumber, and a few other things to make it today. This recipe from Foodista has 1 fans. It works well as an expensive main course. From preparation to the plate, this recipe takes around 45 minutes. With a spoonacular score of 92%, this dish is spectacular. If you like this recipe, take a look at these similar recipes: Lettuce and Fennel Salad with Citrus Vinaigrette, Lettuce, Apple, and Cucumber Salad with Fennel and Walnuts, and Beet Salad With Peppers and Lettuce.","You can never have too many Mediterranean recipes, so give Gluten Free Vegan Gnocchi a try. This recipe serves 4. This hor d'oeuvre has 133 calories, 4g of protein, and 0g of fat per serving. For 31 cents per serving, this recipe covers 7% of your daily requirements of vitamins and minerals. This recipe from Foodista requires salt and pepper, ener-g egg replacer, chickpea flour, and potato starch. 1 person has made this recipe and would make it again. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and vegan diet. From preparation to the plate, this recipe takes about 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 84%. This score is outstanding. Users who liked this recipe also liked Gluten Free Vegan Gnocchi, Gluten-Free Vegan Walnut and Oat Brownies (Vegan, Gluten-Free, Grain-Free, Flourless, Dairy-Free, No Refined Sugar), and Gluten-Free Vegan Walnut and Oat Brownies (Vegan, Gluten-Free, Grain-Free, Flourless, Dairy-Free, No Refined Sugar).","Summer Berry Pudding might be just the dessert you are searching for. Watching your figure? This dairy free, lacto ovo vegetarian, and vegan recipe has 44 calories, 0g of protein, and 0g of fat per serving. This recipe serves 8. For 30 cents per serving, this recipe covers 1% of your daily requirements of vitamins and minerals. A mixture of castor sugar, punnets each raspberries, cherries, and a handful of other ingredients are all it takes to make this recipe so delicious. It will be a hit at your The Fourth Of July event. This recipe is liked by 1 foodies and cooks. From preparation to the plate, this recipe takes approximately 45 minutes. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 9%, which is very bad (but still fixable). Similar recipes include Berry Summer Pudding, Summer Berry Pudding, and Summer Berry Pudding.","Powerhouse Almond Matcha Superfood Smoothie is a breakfast that serves 2. One serving contains 289 calories, 11g of protein, and 13g of fat. For $2.59 per serving, this recipe covers 27% of your daily requirements of vitamins and minerals. If you have chia seeds, matcha tea powder, banana, and a few other ingredients on hand, you can make it. It is a good option if you're following a gluten free, dairy free, and whole 30 diet. This recipe from Foodista has 80 fans. From preparation to the plate, this recipe takes around 10 minutes. All things considered, we decided this recipe deserves a spoonacular score of 98%. This score is awesome. If you like this recipe, take a look at these similar recipes: Powerhouse Almond Matcha Superfood Smoothie, Chocolate Almond Superfood Smoothie, and Powerhouse Golden Turmeric Smoothie.","If you have around 45 minutes to spend in the kitchen, Doughnuts might be an amazing lacto ovo vegetarian recipe to try. For 68 cents per serving, you get a breakfast that serves 2. One serving contains 445 calories, 13g of protein, and 2g of fat. If you have warm water, honey, powdered milk, and a few other ingredients on hand, you can make it. It is brought to you by Afrolems. Several people made this recipe, and 205 would say it hit the spot. With a spoonacular score of 96%, this dish is tremendous. Users who liked this recipe also liked How to make doughnuts (with video) and Coffee-Biscoff-Bacon Doughnuts, Everything Doughnuts, and Cranberry Doughnuts.","Goldilocks Chia Seed Porridge could be just the gluten free, dairy free, paleolithic, and lacto ovo vegetarian recipe you've been looking for. For $2.63 per serving, you get a breakfast that serves 1. One portion of this dish contains around 13g of protein, 26g of fat, and a total of 387 calories. It is brought to you by Foodista. Head to the store and pick up sesame seeds, mango, chia seeds, and a few other things to make it today. From preparation to the plate, this recipe takes around 15 minutes. 4 people found this recipe to be scrumptious and satisfying. Overall, this recipe earns a super spoonacular score of 90%. Try Goldilocks Chia Seed Porridge, Chia Seed Porridge with Orange & Yogurt, and Raspberry Chia Seed Jam and A Chia Giveaway for similar recipes.","If you have roughly 45 minutes to spend in the kitchen, Peaches And Cream Oatmeal might be a great gluten free and lacto ovo vegetarian recipe to try. This recipe serves 1 and costs 92 cents per serving. One serving contains 408 calories, 16g of protein, and 7g of fat. 2 people have made this recipe and would make it again. It works well as a breakfast. Head to the store and pick up cream cheese, cinnamon, non-fat milk, and a few other things to make it today. It is brought to you by Foodista. With a spoonacular score of 87%, this dish is super. Similar recipes include Peaches and Cream Oatmeal, Peaches And Cream Oatmeal, and Peaches & Coconut Cream Oatmeal.","Chilled Swiss Oatmeal takes roughly 10 minutes from beginning to end. This recipe serves 1 and costs $1.89 per serving. One portion of this dish contains around 17g of protein, 14g of fat, and a total of 523 calories. It is brought to you by Foodista. Not a lot of people made this recipe, and 7 would say it hit the spot. It works well as a breakfast. A mixture of apple, cranberry, banana, and a handful of other ingredients are all it takes to make this recipe so scrumptious. It is a good option if you're following a gluten free and lacto ovo vegetarian diet. Overall, this recipe earns an outstanding spoonacular score of 87%. If you like this recipe, take a look at these similar recipes: Chilled Swiss Oatmeal, Chilled Swiss Oatmeal, and Quick & Healthy Breakfast – Chilled Swiss Oatmeal.","Need a gluten free breakfast? Protein Strawberry Smoothie could be a super recipe to try. This recipe makes 1 servings with 388 calories, 34g of protein, and 4g of fat each. For $5.22 per serving, this recipe covers 28% of your daily requirements of vitamins and minerals. This recipe is liked by 4 foodies and cooks. It can be enjoyed any time, but it is especially good for Mother's Day. Head to the store and pick up honey, banana, strawberries, and a few other things to make it today. From preparation to the plate, this recipe takes about 5 minutes. This recipe is typical of Mexican cuisine. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 83%, which is great. If you like this recipe, take a look at these similar recipes: Strawberry Protein Smoothie, Strawberry Protein Smoothie, and Protein Strawberry Smoothie.","Swiss Bircher Muesli might be a good recipe to expand your breakfast recipe box. This lacto ovo vegetarian recipe serves 1 and costs $1.31 per serving. One serving contains 363 calories, 12g of protein, and 7g of fat. 1 person has made this recipe and would make it again. From preparation to the plate, this recipe takes approximately 45 minutes. This recipe from Foodista requires apple, milk, muesli, and vanilla yoghurt. Overall, this recipe earns an excellent spoonacular score of 84%. If you like this recipe, you might also like recipes such as Bircher Muesli, Bircher Muesli, and Bircher Muesli.","Stuffed Artichoke Main Dish is a gluten free recipe with 2 servings. One portion of this dish contains approximately 56g of protein, 9g of fat, and a total of 500 calories. For $3.58 per serving, this recipe covers 41% of your daily requirements of vitamins and minerals. This recipe from Foodista requires mozzarella cheese, chicken breasts, garlic, and parmesan. 18 people have tried and liked this recipe. A few people really liked this main course. From preparation to the plate, this recipe takes approximately 1 hour. With a spoonacular score of 95%, this dish is excellent. Similar recipes are Main-Dish Minestrone, Main-Dish Shrimp Salad, and Tuna Noodle Main Dish.","Garlicky Kale requires approximately 45 minutes from start to finish. This side dish has 170 calories, 2g of protein, and 15g of fat per serving. This recipe serves 2. For 69 cents per serving, this recipe covers 17% of your daily requirements of vitamins and minerals. 19 people have made this recipe and would make it again. This recipe from Foodista requires balsamic vinegar, garlic, curly kale, and olive oil. It is a good option if you're following a gluten free, dairy free, paleolithic, and lacto ovo vegetarian diet. With a spoonacular score of 99%, this dish is outstanding. Try Garlicky Kale, Garlicky Kale, and Garlicky Kale for similar recipes.","The recipe Crunchy Brussels Sprouts Side Dish can be made in about 30 minutes. For $1.69 per serving, you get a side dish that serves 4. One serving contains 232 calories, 8g of protein, and 16g of fat. This recipe is liked by 26 foodies and cooks. It is brought to you by Foodista. A mixture of red wine vinegar, walnuts, dijon mustard, and a handful of other ingredients are all it takes to make this recipe so yummy. It is a good option if you're following a gluten free, dairy free, paleolithic, and lacto ovo vegetarian diet. All things considered, we decided this recipe deserves a spoonacular score of 98%. This score is spectacular. Similar recipes include Side Dish Sundays: Cacio e Pepe Brussels Sprouts, Easy Side Dish – Roasted Brussels Sprouts and Grapes, and Side Dish Sundays: Cacio e Pepe Brussels Sprouts."]